books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
#+OPTIONS: ^:nil
* Necessary imports
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.firefox.FirefoxDriver;
#+end_src
* Fetch page: get(String url)
driver.get("http://www.url.com/");     // fetch website

#+begin_src java
  package com.packt.webdriver.chapter1;

  import org.openqa.selenium.WebDriver;
  import org.openqa.selenium.firefox.FirefoxDriver;

  public class NavigateToAUrl {
      public static void main(String[] args) {
          WebDriver driver = new FirefoxDriver();
          driver.get("http://www.packtpub.com");
      }
  }
#+end_src
* Finding web elements
** WebElement findElement(By by)
WebElement searchBox = driver.findElement(By.name("q"));  // find by name
NoSuchElement Exception if there is no match on current page.
Use findElements instead if you need zero or more matches, instead of only the first match.
*** By.name(String elementName)
#+begin_src java
  public class GoogleSearchButtonByName {
    public static void main(String[] args){
      WebDriver driver = new FirefoxDriver();
      driver.get("http://www.google.com");
      WebElement searchBox = driver.findElement(By.name("btnK"));
      searchBox.submit();
    }
  }
#+end_src
*** By.id(String elementId)
#+begin_src java
  public class GoogleSearchButtonById {
    public static void main(String[] args){
      WebDriver driver = new FirefoxDriver();
      driver.get("http://www.google.com");
      WebElement searchBox = driver.findElement(By.id("gbqfba"));
      searchBox.submit();
    }
  }
#+end_src
