books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Selenium-WebDriver-Practical-Guide_Packt_2014</title>
<!-- 2015-05-19 Tue 15:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lewis Cawthorne" />
</head>
<body>
<div id="content">
<h1 class="title">Selenium-WebDriver-Practical-Guide_Packt_2014</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Necessary imports</a></li>
<li><a href="#sec-2">Fetch page: get(String url)</a></li>
<li><a href="#sec-3">Finding web elements</a>
<ul>
<li><a href="#sec-3-1">WebElement findElement(By by)</a>
<ul>
<li><a href="#sec-3-1-1">By.name(String elementName)</a></li>
<li><a href="#sec-3-1-2">By.id(String elementId)</a></li>
<li><a href="#sec-3-1-3">By.tagName(String elementsTag)</a></li>
<li><a href="#sec-3-1-4">By.className(String elementClass)</a></li>
<li><a href="#sec-3-1-5">By.linkText(String linkText)</a></li>
<li><a href="#sec-3-1-6">By.partialLinkText(String link Text)</a></li>
<li><a href="#sec-3-1-7">By.xpath(String xpath)</a></li>
<li><a href="#sec-3-1-8">By.cssSelector(String elementSelector)</a></li>
</ul>
</li>
<li><a href="#sec-3-2">List&lt;WebElement&gt; findElements(By by)</a></li>
<li><a href="#sec-3-3">Using Firebug to help determine elts for Selenium</a>
<ul>
<li><a href="#sec-3-3-1">Inspecting a webpage element</a></li>
<li><a href="#sec-3-3-2">Finding XPath for By.xpath(String xpath) method</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">Basic Actions on WebElement 'elt'</a>
<ul>
<li><a href="#sec-4-1">String elt.getAttribute(String attName)</a></li>
<li><a href="#sec-4-2">void elt.sendKeys(CharSequence keysToSend)</a>
<ul>
<li><a href="#sec-4-2-1">elt.sendKeys(Keys.ENTER);</a></li>
<li><a href="#sec-4-2-2">elt.sendKeys(Keys.chords(Keys.SHIFT, "packt publishing"));</a></li>
</ul>
</li>
<li><a href="#sec-4-3">void elt.clear()  // erase text in a WebElement; easier than sending multiple Keys.BACK_SPACE</a></li>
<li><a href="#sec-4-4">void elt.submit() // submits a form</a></li>
<li><a href="#sec-4-5">String elt.getCssValue(String propertyName)</a></li>
<li><a href="#sec-4-6">Point elt.getLocation();</a></li>
<li><a href="#sec-4-7">Dimension elt.getSize()</a></li>
<li><a href="#sec-4-8">String elt.getText()</a></li>
<li><a href="#sec-4-9">String elt.getTagName()</a></li>
<li><a href="#sec-4-10">boolean elt.isDisplayed()</a></li>
<li><a href="#sec-4-11">boolean elt.isEnabled()</a></li>
<li><a href="#sec-4-12">boolean elt.isSelected()</a></li>
</ul>
</li>
<li><a href="#sec-5">Complex Actions</a>
<ul>
<li><a href="#sec-5-1">Composite/Multi-step Actions</a></li>
<li><a href="#sec-5-2">Mouse-based Interactions</a>
<ul>
<li><a href="#sec-5-2-1">public Actions moveByOffset(int xOffset, int yOffSet)</a></li>
<li><a href="#sec-5-2-2">public Actions click()</a></li>
<li><a href="#sec-5-2-3">public Actions click(WebElement onElement)</a></li>
<li><a href="#sec-5-2-4">public Actions clickAndHold()</a></li>
<li><a href="#sec-5-2-5">public Actions clickAndHold(WebElement onElement)</a></li>
<li><a href="#sec-5-2-6">public Actions release()</a></li>
<li><a href="#sec-5-2-7">public Actions release(WebElement onElement)</a></li>
<li><a href="#sec-5-2-8">public Actions moveToElement(WebElement toElement)</a></li>
<li><a href="#sec-5-2-9">public Actions dragAndDropBy(WebElement source, int xOffset, int yOffset)</a></li>
<li><a href="#sec-5-2-10">public Actions dragAndDrop(WebElement source, WebElement target)</a></li>
<li><a href="#sec-5-2-11">public Actions doubleClick()</a></li>
<li><a href="#sec-5-2-12">public Actions doubleClick(WebElement onElement)</a></li>
<li><a href="#sec-5-2-13">public Actions contextClick(WebElement onElement)</a></li>
<li><a href="#sec-5-2-14">public Actions contextClick()</a></li>
</ul>
</li>
<li><a href="#sec-5-3">Keyboard-based interactions</a>
<ul>
<li><a href="#sec-5-3-1">public Actions keyDown(Keys theKey) throws IllegalArgumentException</a></li>
<li><a href="#sec-5-3-2">public Actions keyUp(Keys theKey)</a></li>
<li><a href="#sec-5-3-3">public Actions sendKeys(CharSequence keysToSend)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">Waiting for WebElements to load</a>
<ul>
<li><a href="#sec-6-1">Implicit Wait Time</a></li>
<li><a href="#sec-6-2">Explicit Wait Time</a></li>
</ul>
</li>
<li><a href="#sec-7">Windows and iFrames</a>
<ul>
<li><a href="#sec-7-1">Multiple Windows</a></li>
<li><a href="#sec-7-2">Multiple Frames</a></li>
<li><a href="#sec-7-3">Handling Alerts is covered under special capabilities.</a></li>
</ul>
</li>
<li><a href="#sec-8">Navigation</a>
<ul>
<li><a href="#sec-8-1">Navigation object methods</a></li>
</ul>
</li>
<li><a href="#sec-9">Cookies</a>
<ul>
<li><a href="#sec-9-1">Fetching all loaded cookies for a page: driver.manage().getCookies();</a></li>
<li><a href="#sec-9-2">Load a stored cookied: driver.manage().addCookie(ck);</a></li>
</ul>
</li>
<li><a href="#sec-10">Special capabilities</a>
<ul>
<li><a href="#sec-10-1">Adding Capabilities to the WebDriver</a></li>
<li><a href="#sec-10-2">Common capabilities</a>
<ul>
<li><a href="#sec-10-2-1">takesScreenShot</a></li>
<li><a href="#sec-10-2-2">handlesAlert</a></li>
<li><a href="#sec-10-2-3">cssSelectorsEnabled</a></li>
<li><a href="#sec-10-2-4">javascriptEnabled</a></li>
<li><a href="#sec-10-2-5">acceptSSLCerts</a></li>
<li><a href="#sec-10-2-6">webStorageEnabled</a></li>
</ul>
</li>
<li><a href="#sec-10-3">Using special capabilities</a>
<ul>
<li><a href="#sec-10-3-1">Screenshots</a></li>
<li><a href="#sec-10-3-2">Handling alerts</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-11">Firefox Specific Features</a>
<ul>
<li><a href="#sec-11-1">Using a specific Firefox Profile</a></li>
<li><a href="#sec-11-2">Installing a browser extension in the WebDriver profile</a></li>
<li><a href="#sec-11-3">Setting Profile Preferences</a></li>
</ul>
</li>
<li><a href="#sec-12">Testing with Custom Events</a>
<ul>
<li><a href="#sec-12-1">Flow of Setting up to Capture Events during Test Execution</a></li>
<li><a href="#sec-12-2">Creating an instance of EventListener (done one of two ways)</a>
<ul>
<li><a href="#sec-12-2-1">Implementing WebDriverEventListener (more verbose)</a></li>
<li><a href="#sec-12-2-2">Extending the AbstractWebDriverEventListener</a></li>
<li><a href="#sec-12-2-3">Example with Custom Listener and Registered Driver</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-13">Understanding the Page Object Pattern</a>
<ul>
<li><a href="#sec-13-1">WordPress blog Sample Test Cases - Fine Tests that are manual to maintain.</a></li>
<li><a href="#sec-13-2">WordPress blog using PageObject pattern</a>
<ul>
<li><a href="#sec-13-2-1">AdminLoginPage</a></li>
<li><a href="#sec-13-2-2">TestAddNewPostUsingPageObject</a></li>
</ul>
</li>
<li><a href="#sec-13-3">Using the <b>@FindBy</b> annotation to locate elements on a page</a>
<ul>
<li><a href="#sec-13-3-1">Different ways to @FindBy supported by the How enumeration</a></li>
<li><a href="#sec-13-3-2">Wordpress AdminLoginPage using How and @FindBy</a></li>
</ul>
</li>
<li><a href="#sec-13-4">Using the <b>PageFactory</b> class</a>
<ul>
<li><a href="#sec-13-4-1">A PageFactory instantiates a Page object that uses the <b>@FindBy</b> annotations and gives it a driver</a></li>
<li><a href="#sec-13-4-2">initElements(WebDriver driver, java.lang.Class PageObjectClass)</a></li>
<li><a href="#sec-13-4-3">Example Use</a></li>
</ul>
</li>
<li><a href="#sec-13-5">Good practices for using PageObjects</a>
<ul>
<li><a href="#sec-13-5-1">Use PageObjects within PageObjects</a></li>
<li><a href="#sec-13-5-2">Consider methods in PageObjects as services and not as User Actions</a></li>
<li><a href="#sec-13-5-3">Initialize some elements as required; especially lists (source example)</a></li>
<li><a href="#sec-13-5-4">Keep page specific details of the test script (main goal!)</a></li>
</ul>
</li>
<li><a href="#sec-13-6">Checking load()/isLoad() with <b>LoadableComponent</b> class</a>
<ul>
<li><a href="#sec-13-6-1">load specifies a url that should be loaded</a></li>
<li><a href="#sec-13-6-2">isLoaded checks that the page specified in load() came up</a></li>
<li><a href="#sec-13-6-3">the get method attempts the load() and does the isLoaded() check</a></li>
<li><a href="#sec-13-6-4">Full example of use</a></li>
</ul>
</li>
<li><a href="#sec-13-7">Full Wordpress PageObject example with TestCases</a>
<ul>
<li><a href="#sec-13-7-1">PageObject's</a></li>
<li><a href="#sec-13-7-2">Tests</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-14">Skipped Chapters: Dealing with I/O (FileHandler, isZipped, etc), RemoteWebDriver, Selenium Grid, iOS/Android</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Necessary imports</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Fetch page: get(String url)</h2>
<div class="outline-text-2" id="text-2">
<p>
driver.get("<a href="http://www.url.com/">http://www.url.com/</a>");     // fetch website
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.webdriver.<span style="color: #6D9CBE;">chapter1</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">NavigateToAUrl</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>) {
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
        driver.get(<span style="color: #A5C261;">"http://www.packtpub.com"</span>);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Finding web elements</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">WebElement findElement(By by)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
WebElement searchBox = driver.findElement(By.name("q"));  // find by name
NoSuchElement Exception if there is no match on current page.
Use findElements instead if you need zero or more matches, instead of only the first match.
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">By.name(String elementName)</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchButtonByName</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    searchBox.submit();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">By.id(String elementId)</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchButtonById</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.id(<span style="color: #A5C261;">"gbqfba"</span>));
    searchBox.submit();
  }
}
</pre>
</div>
</div>
</div>
