books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** By.tagName(String elementsTag)
More commonly used with findElements, as it is less likely to uniquely match 
#+begin_src java
   public class GoogleSearchPageByTagName {
      public static void main(String[] args){
          WebDriver driver = new FirefoxDriver();
          driver.get("http://www.google.com");
          List<WebElement> buttons =   driver.findElements(By.tagName("button"));
          System.out.println(buttons.size());
      }
  }
#+end_src
*** By.className(String elementClass)
More commonly used with CSS styling, class can be unique or match a set of items
#+begin_src java
 public class GoogleSearchByClassName{
   public static void main(String[] args){
     WebDriver driver = new FirefoxDriver();
     driver.get("http://www.google.com");
     WebElement searchBox = driver.findElement(By.className("gbqfif"));
     searchBox.sendKeys("Packt Publishing");
   }
 }
#+end_src
*** By.linkText(String linkText)
This is the text of the link as it appears on the webpage, not a property of the <a> tag
Example: "About Google"
#+begin_src java
public class GoogleSearchByLinkText{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement aboutLink = driver.findElement(By.linkText("About Google"));
    aboutLink.click();
  }
}
#+end_src
*** By.partialLinkText(String link Text)
This matches part of the display link text, Ex: "About"
#+begin_src java
public class GoogleSearchByPartialLinkText{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement aboutLink = driver.findElement(By.partialLinkText("About"));
    aboutLink.click();
  }
}
#+end_src
*** By.xpath(String xpath)
XPath is a short name for XML path. Firebug with Firepath makes it easy to find these.
#+begin_src java
public class GoogleSearchByXPath{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton =  driver.findElement(By.xpath("//*[@id='gbqfba']"));
    System.out.println(searchButton.getText());
  }
 }
#+end_src
**** XPath can be very slow, compared to other methods, and requires much scanning!
**** The root element is //
**** All div elemnts are //div
**** Link tags within div elements are //div/a
**** All the elemtns with a tag are matched by *.  So //div/* is everything in a div
**** All the div elements three levels down are //*/*/div
**** //*/div/a[@id='attrValue'] is the anchor element with id attrValue three levels down within a div
*** By.cssSelector(String elementSelector)
CSS Selector is faster than XPath, but similar.
**** To identify an element using the div element with id #flrs, By.cssSelector("#flrs")
**** To identify the child anchor element, By.cssSelector("#flrs > a")
**** To identify the anchor element with its attribute, By.cssSelector("#flrs>a[a[href='/intl/en/about.html']]")
#+begin_src java
public class GoogleSearchByCSSSelector{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.cssSelector("#flrs>a[href='/intl/en/about.html']"));
    System.out.println(searchButton.getText());
  }
}
#+end_src
** List<WebElement> findElements(By by)
Same By type clause as findElement, but it doesn't throw an exception on zero matches

Use WebDriver's findElements() method if you think you need all the WebElements that
satisfy a locating mechanism condition.
** Using Firebug to help determine elts for Selenium
*** Inspecting a webpage element
Click on Firebug, in the Firebug panel there is a white box with a cursor over it.  This is the "Inspect Element"
button.  Click it, then the element you want to inspect.  If we do this for the Google site search box, we get:

<input type="text" name="q" value="" id="searchText" maxlength="256" dir="auto" placeholder="Yahoo" 
       autocomplete="off" aria-autocomplete="true" aria-controls="searchSuggestionTable" aria-expanded="false"/>

So, we could easily find this element by name or id.  name, class, or id are normally useful.
The developer of the test script needs to determine teh best way to uniquely determine an element or elements.
*** Finding XPath for By.xpath(String xpath) method
Just click the FirePath tab and click inspect element.  The XPath is in the XPath box.
Ex: Google search button is XPath: ".//*[@id='searchSubmit']"
* Basic Actions on WebElement 'elt'
