books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">By.tagName(String elementsTag)</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
More commonly used with findElements, as it is less likely to uniquely match 
</p>
<div class="org-src-container">

<pre class="src src-java"> <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchPageByTagName</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
        driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
        <span style="color: #6D9CBE;">List</span>&lt;<span style="color: #6D9CBE;">WebElement</span>&gt; <span style="color: #C8C8FF;">buttons</span> =   driver.findElements(By.tagName(<span style="color: #A5C261;">"button"</span>));
        System.out.println(buttons.size());
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-4" class="outline-4">
<h4 id="sec-3-1-4">By.className(String elementClass)</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
More commonly used with CSS styling, class can be unique or match a set of items
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchByClassName</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.className(<span style="color: #A5C261;">"gbqfif"</span>));
    searchBox.sendKeys(<span style="color: #A5C261;">"Packt Publishing"</span>);
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-5" class="outline-4">
<h4 id="sec-3-1-5">By.linkText(String linkText)</h4>
<div class="outline-text-4" id="text-3-1-5">
<p>
This is the text of the link as it appears on the webpage, not a property of the &lt;a&gt; tag
Example: "About Google"
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchByLinkText</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">aboutLink</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"About Google"</span>));
    aboutLink.click();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-6" class="outline-4">
<h4 id="sec-3-1-6">By.partialLinkText(String link Text)</h4>
<div class="outline-text-4" id="text-3-1-6">
<p>
This matches part of the display link text, Ex: "About"
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchByPartialLinkText</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">aboutLink</span> = driver.findElement(By.partialLinkText(<span style="color: #A5C261;">"About"</span>));
    aboutLink.click();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-7" class="outline-4">
<h4 id="sec-3-1-7">By.xpath(String xpath)</h4>
<div class="outline-text-4" id="text-3-1-7">
<p>
XPath is a short name for XML path. Firebug with Firepath makes it easy to find these.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchByXPath</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> =  driver.findElement(By.xpath(<span style="color: #A5C261;">"//*[@id='gbqfba']"</span>));
    System.out.println(searchButton.getText());
  }
 }
</pre>
</div>
</div>
<ul class="org-ul"><li><a id="sec-3-1-7-1" name="sec-3-1-7-1"></a>XPath can be very slow, compared to other methods, and requires much scanning!<br  /></li>
<li><a id="sec-3-1-7-2" name="sec-3-1-7-2"></a>The root element is //<br  /></li>
<li><a id="sec-3-1-7-3" name="sec-3-1-7-3"></a>All div elemnts are //div<br  /></li>
<li><a id="sec-3-1-7-4" name="sec-3-1-7-4"></a>Link tags within div elements are //div/a<br  /></li>
<li><a id="sec-3-1-7-5" name="sec-3-1-7-5"></a>All the elemtns with a tag are matched by <b>.  So <i>/div</i></b> is everything in a div<br  /></li>
<li><a id="sec-3-1-7-6" name="sec-3-1-7-6"></a>All the div elements three levels down are //*/*/div<br  /></li>
<li><a id="sec-3-1-7-7" name="sec-3-1-7-7"></a>//*/div/a[@id='attrValue'] is the anchor element with id attrValue three levels down within a div<br  /></li></ul>
</div>
<div id="outline-container-sec-3-1-8" class="outline-4">
<h4 id="sec-3-1-8">By.cssSelector(String elementSelector)</h4>
<div class="outline-text-4" id="text-3-1-8">
<p>
CSS Selector is faster than XPath, but similar.
</p>
</div>
<ul class="org-ul"><li><a id="sec-3-1-8-1" name="sec-3-1-8-1"></a>To identify an element using the div element with id #flrs, By.cssSelector("#flrs")<br  /></li>
<li><a id="sec-3-1-8-2" name="sec-3-1-8-2"></a>To identify the child anchor element, By.cssSelector("#flrs &gt; a")<br  /></li>
<li><a id="sec-3-1-8-3" name="sec-3-1-8-3"></a>To identify the anchor element with its attribute, By.cssSelector("#flrs&gt;a[a[href='/intl/en/about.html']]")<br  /><div class="outline-text-5" id="text-3-1-8-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GoogleSearchByCSSSelector</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.cssSelector(<span style="color: #A5C261;">"#flrs&gt;a[href='/intl/en/about.html']"</span>));
    System.out.println(searchButton.getText());
  }
}
</pre>
</div>
</div>
</li></ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">List&lt;WebElement&gt; findElements(By by)</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Same By type clause as findElement, but it doesn't throw an exception on zero matches
</p>

<p>
Use WebDriver's findElements() method if you think you need all the WebElements that
satisfy a locating mechanism condition.
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Using Firebug to help determine elts for Selenium</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">Inspecting a webpage element</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Click on Firebug, in the Firebug panel there is a white box with a cursor over it.  This is the "Inspect Element"
button.  Click it, then the element you want to inspect.  If we do this for the Google site search box, we get:
</p>

<p>
&lt;input type="text" name="q" value="" id="searchText" maxlength="256" dir="auto" placeholder="Yahoo" 
       autocomplete="off" aria-autocomplete="true" aria-controls="searchSuggestionTable" aria-expanded="false"/&gt;
</p>

<p>
So, we could easily find this element by name or id.  name, class, or id are normally useful.
The developer of the test script needs to determine teh best way to uniquely determine an element or elements.
</p>
</div>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">Finding XPath for By.xpath(String xpath) method</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
Just click the FirePath tab and click inspect element.  The XPath is in the XPath box.
Ex: Google search button is XPath: ".//*[@id='searchSubmit']"
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Basic Actions on WebElement 'elt'</h2>
