books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
** String elt.getAttribute(String attName)
Web Elements let you fetch attributes with getAttribute(attName)

Some popular attributes include name, class, id, href, aria-label

#+begin_src java
public class GetAttributes{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println("Name of the button is: "
                         +searchButton.getAttribute("name"));
    System.out.println("Id of the button is: "                         +searchButton.getAttribute("id"));
    System.out.println("Class of the button is: "
                         +searchButton.getAttribute("class"));
    System.out.println("Label of the button is: "
                         +searchButton.getAttribute("aria-  label"));
  }
}
#+end_src
** void elt.sendKeys(CharSequence keysToSend)
Only appropriate for TextBoxes and other character accepting elements.

#+begin_src java
public class sendKeys{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchBox = driver.findElement(By.name("q"));
    searchButton.sendKeys("Packt Publishing");
  }
}
#+end_src

WebDriver contains a Keys enum for special keys
*** elt.sendKeys(Keys.ENTER);
*** elt.sendKeys(Keys.chords(Keys.SHIFT, "packt publishing"));
#+begin_src java
 public class SendKeys{
   public static void main(String[] args){
     WebDriver driver = new FirefoxDriver();
     driver.get("http://www.google.com");
     WebElement searchBox = driver.findElement(By.name("q"));
     searchBox.sendKeys(Keys.chord(Keys.SHIFT,"packt publishing"));
   }
 }
#+end_src
** void elt.clear()  // erase text in a WebElement; easier than sending multiple Keys.BACK_SPACE
#+begin_src java
public class Clear{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchBox = driver.findElement(By.name("q"));
    searchBox.sendKeys(Keys.chord(Keys.SHIFT,"packt publishing"));
    searchBox.clear();
  }
}
#+end_src
** void elt.submit() // submits a form
throws NoSuchElementException if executed on an element not within a form

#+begin_src java
public class Submit{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchBox = driver.findElement(By.name("q"));
    searchBox.sendKeys(Keys.chord(Keys.SHIFT,"packt publishing"));
    searchBox.submit();
  }
}
#+end_src
** String elt.getCssValue(String propertyName)
** Point elt.getLocation();
#+begin_src java
public class GetLocation{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.getLocation());
  }
}
// Snippet prints out 372, 356 currently in Google.  The (x,y) location of Google Search button.
#+end_src
** Dimension elt.getSize()
The width and height of the element
#+begin_src java
public class GetSize{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.getSize());
  }
}
#+end_src
** String elt.getText()
Returns the visible innerText string of the WebElement or empty string.
#+begin_src java
public class GetText{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.getText());
  }
}
#+end_src
