books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">String elt.getAttribute(String attName)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Web Elements let you fetch attributes with getAttribute(attName)
</p>

<p>
Some popular attributes include name, class, id, href, aria-label
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GetAttributes</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(<span style="color: #A5C261;">"Name of the button is: "</span>
                         +searchButton.getAttribute(<span style="color: #A5C261;">"name"</span>));
    System.out.println(<span style="color: #A5C261;">"Id of the button is: "</span>                         +searchButton.getAttribute(<span style="color: #A5C261;">"id"</span>));
    System.out.println(<span style="color: #A5C261;">"Class of the button is: "</span>
                         +searchButton.getAttribute(<span style="color: #A5C261;">"class"</span>));
    System.out.println(<span style="color: #A5C261;">"Label of the button is: "</span>
                         +searchButton.getAttribute(<span style="color: #A5C261;">"aria-  label"</span>));
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">void elt.sendKeys(CharSequence keysToSend)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Only appropriate for TextBoxes and other character accepting elements.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">sendKeys</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
    searchButton.sendKeys(<span style="color: #A5C261;">"Packt Publishing"</span>);
  }
}
</pre>
</div>

<p>
WebDriver contains a Keys enum for special keys
</p>
</div>
<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1">elt.sendKeys(Keys.ENTER);</h4>
</div>
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2">elt.sendKeys(Keys.chords(Keys.SHIFT, "packt publishing"));</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">SendKeys</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
    searchBox.sendKeys(Keys.chord(<span style="color: #6D9CBE;">Keys</span>.SHIFT,<span style="color: #A5C261;">"packt publishing"</span>));
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">void elt.clear()  // erase text in a WebElement; easier than sending multiple Keys.BACK_SPACE</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">Clear</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
    searchBox.sendKeys(Keys.chord(<span style="color: #6D9CBE;">Keys</span>.SHIFT,<span style="color: #A5C261;">"packt publishing"</span>));
    searchBox.clear();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">void elt.submit() // submits a form</h3>
<div class="outline-text-3" id="text-4-4">
<p>
throws NoSuchElementException if executed on an element not within a form
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">Submit</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
    searchBox.sendKeys(Keys.chord(<span style="color: #6D9CBE;">Keys</span>.SHIFT,<span style="color: #A5C261;">"packt publishing"</span>));
    searchBox.submit();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5">String elt.getCssValue(String propertyName)</h3>
</div>
<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6">Point elt.getLocation();</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GetLocation</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.getLocation());
  }
}
<span style="color: #BC9458;">// </span><span style="color: #BC9458;">Snippet prints out 372, 356 currently in Google.  The (x,y) location of Google Search button.</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7">Dimension elt.getSize()</h3>
<div class="outline-text-3" id="text-4-7">
<p>
The width and height of the element
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GetSize</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.getSize());
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8">String elt.getText()</h3>
<div class="outline-text-3" id="text-4-8">
<p>
Returns the visible innerText string of the WebElement or empty string.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GetText</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.getText());
  }
}
</pre>
</div>
</div>
</div>
