books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
** String elt.getTagName()
tag name of the web element.  The following prints out 'button'
#+begin_src java
public class GetTagName{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.getTagName());
  }
}
#+end_src
** boolean elt.isDisplayed()
verifies an element is displayed on the page
#+begin_src java
public class isDisplayed{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.isDisplayed());
  }
}
#+end_src
** boolean elt.isEnabled()
verifies an element is enabled on the page
#+begin_src java
public class isDisplayed{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.isEnabled());
  }
}
#+end_src
** boolean elt.isSelected()
Verifies a WebElement is selected on the page
It only returns true for a radio button, options in select, or checkbox that is selected
The following always returns false, since a search box is not one of these.
#+begin_src java
public class isSelected{
  public static void main(String[] args){
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement searchButton = driver.findElement(By.name("btnK"));
    System.out.println(searchButton.isSelected());
  }
}
#+end_src
* Complex Actions
** Composite/Multi-step Actions
You can use an Actions class to accomplish this.
Let's say you want to hold control while clicking 1, 3, and 5.  The following would accomplish this:
#+begin_src java
public class ActionBuildPerform {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/selectable.html");
    WebElement one = driver.findElement(By.name("one"));
    WebElement three = driver.findElement(By.name("three"));
    WebElement five = driver.findElement(By.name("five"));
    // Add all the actions into the Actions builder.
    Actions builder = new Actions(driver);
    builder.keyDown(Keys.CONTROL)
            .click(one)
            .click(three)
            .click(five)
            .keyUp(Keys.CONTROL);
    // Generate the composite action.
    Action compositeAction = builder.build();
    // Perform the composite action.
    compositeAction.perform();
  }
}
#+end_src

Actually, the perform action will automatically call build, so the following is equivalent:

#+begin_src java
  public class ActionBuildPerform {
      public static void main(String... args) {
        WebDriver driver = new FirefoxDriver();
        driver.get("file://C:/selectable.html");
        WebElement one = driver.findElement(By.name("one"));
        WebElement three = driver.findElement(By.name("three"));
        WebElement five = driver.findElement(By.name("five"));
        // Add all the actions into the Actions builder.
        Actions builder = new Actions(driver);
        builder.keyDown(Keys.CONTROL)
                .click(one)
                .click(three)
                .click(five)
                .keyUp(Keys.CONTROL);
         // Perform the action.
         builder.perform();
    }
  }
#+end_src
** Mouse-based Interactions
This is the web, so you often want to interact using the mouse.  
There are eight different mouse actions that can be performed using the Actions class.
