books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-4-9" class="outline-3">
<h3 id="sec-4-9">String elt.getTagName()</h3>
<div class="outline-text-3" id="text-4-9">
<p>
tag name of the web element.  The following prints out 'button'
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">GetTagName</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.getTagName());
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-10" class="outline-3">
<h3 id="sec-4-10">boolean elt.isDisplayed()</h3>
<div class="outline-text-3" id="text-4-10">
<p>
verifies an element is displayed on the page
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">isDisplayed</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.isDisplayed());
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-11" class="outline-3">
<h3 id="sec-4-11">boolean elt.isEnabled()</h3>
<div class="outline-text-3" id="text-4-11">
<p>
verifies an element is enabled on the page
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">isDisplayed</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.isEnabled());
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-12" class="outline-3">
<h3 id="sec-4-12">boolean elt.isSelected()</h3>
<div class="outline-text-3" id="text-4-12">
<p>
Verifies a WebElement is selected on the page
It only returns true for a radio button, options in select, or checkbox that is selected
The following always returns false, since a search box is not one of these.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">isSelected</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>[] <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnK"</span>));
    System.out.println(searchButton.isSelected());
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Complex Actions</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">Composite/Multi-step Actions</h3>
<div class="outline-text-3" id="text-5-1">
<p>
You can use an Actions class to accomplish this.
Let's say you want to hold control while clicking 1, 3, and 5.  The following would accomplish this:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ActionBuildPerform</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">one</span> = driver.findElement(By.name(<span style="color: #A5C261;">"one"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">five</span> = driver.findElement(By.name(<span style="color: #A5C261;">"five"</span>));
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Add all the actions into the Actions builder.</span>
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.keyDown(<span style="color: #6D9CBE;">Keys</span>.CONTROL)
            .click(one)
            .click(three)
            .click(five)
            .keyUp(<span style="color: #6D9CBE;">Keys</span>.CONTROL);
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Generate the composite action.</span>
    <span style="color: #6D9CBE;">Action</span> <span style="color: #C8C8FF;">compositeAction</span> = builder.build();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Perform the composite action.</span>
    compositeAction.perform();
  }
}
</pre>
</div>

<p>
Actually, the perform action will automatically call build, so the following is equivalent:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ActionBuildPerform</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
      <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
      driver.get(<span style="color: #A5C261;">"file://C:/selectable.html"</span>);
      <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">one</span> = driver.findElement(By.name(<span style="color: #A5C261;">"one"</span>));
      <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
      <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">five</span> = driver.findElement(By.name(<span style="color: #A5C261;">"five"</span>));
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Add all the actions into the Actions builder.</span>
      <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
      builder.keyDown(<span style="color: #6D9CBE;">Keys</span>.CONTROL)
              .click(one)
              .click(three)
              .click(five)
              .keyUp(<span style="color: #6D9CBE;">Keys</span>.CONTROL);
       <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Perform the action.</span>
       builder.perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">Mouse-based Interactions</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This is the web, so you often want to interact using the mouse.  
There are eight different mouse actions that can be performed using the Actions class.
</p>
</div>
