books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** public Actions moveByOffset(int xOffset, int yOffSet)
The mouse is considered to be at (0, 0) initially, unless some other focus is declared.
Offset values are measured in pixels.
xOffset moves left for positive, right for negative values.  
yOffset moves down for positive, up for negative.
This throws MoveTargetOutOfBoundsException if you move the cursor out of the document.

In this example, we add 1 to the X and Y because the  the element has a 1 pixel border in the example page.
#+begin_src java
 public class MoveByOffSet{
   public static void main(String... args) {
     WebDriver driver = new FirefoxDriver();
     driver.get("file://C:/Selectable.html");
     WebElement three = driver.findElement(By.name("three"));
     System.out.println("X coordinate: "+three.getLocation().getX()
                        +"  Y coordinate: "+three.getLocation().getY());
     Actions builder = new Actions(driver);
     builder.moveByOffset(three.getLocation().getX()+1, three.getLocation().getY()+1);
     builder.perform();
   }
 }
#+end_src
*** public Actions click()
#+begin_src java
  public class MoveByOffsetAndClick{
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      driver.get("file://C:/Selectable.html");
      WebElement seven = driver.findElement(By.name("seven"));
      System.out.println("X coordinate: "+seven.getLocation().getX()
                         +" Y coordinate: "+seven.getLocation().getY());
      Actions builder = new Actions(driver);
      builder.moveByOffset(seven.getLocation().getX()+1, seven.getLocation().getY()+1).click();
      builder.perform();
    }
  }
#+end_src

A more complex usage (which we see a much cleaner version of in click(onElement) desc) follows:

#+begin_src java
  public class MoveByOffsetAndClick{
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      driver.get("file://C:/Selectable.html");
      WebElement one = driver.findElement(By.name("one"));
      WebElement eleven = driver.findElement(By.name("eleven"));
      WebElement five = driver.findElement(By.name("five"));
      int border = 1;
      int tileWidth = 100;
      int tileHeight = 80;
      Actions builder = new Actions(driver);
      //Click on One
      builder.moveByOffset(one.getLocation().getX()+border, one.getLocation().getY()+border).click();
      builder.build().perform();
      // Click on Eleven
      builder.moveByOffset(2*tileWidth+4*border, 2*tileHeight+4*border).click();
      builder.build().perform();
      //Click on Five
      builder.moveByOffset(-2*tileWidth-4*border,-tileHeight-2*border).click();
      builder.build().perform();
     }
   }
#+end_src
*** public Actions click(WebElement onElement)
This overloaded version directly clicks an element without having to work with offsets.

#+begin_src java
public class ClickOnWebElement{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Selectable.html");
    WebElement one = driver.findElement(By.name("one"));
    WebElement eleven = driver.findElement(By.name("eleven"));
    WebElement five = driver.findElement(By.name("five"));
    Actions builder = new Actions(driver);
    //Click on One
    builder.click(one);
    builder.build().perform();
    // Click on Eleven
    builder.click(eleven);
    builder.build().perform();
    //Click on Five
    builder.click(five)
    builder.build().perform();
  }
}
#+end_src

This is a lot cleaner than the example in the click() method, and is a great reason to set 
identifiers for WebElements.  We can simplify this example yet again by building all the 
actions before performing them as follows:

#+begin_src java
public class ClickOnWebElement{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Selectable.html");
    WebElement one = driver.findElement(By.name("one"));
    WebElement eleven = driver.findElement(By.name("eleven"));
    WebElement five = driver.findElement(By.name("five"));
    Actions builder = new Actions(driver);
    //Click on One, Eleven and Five
    builder.click(one).click(eleven).click(five);
    builder.build().perform();
  }
}
#+end_src
