books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">public Actions moveByOffset(int xOffset, int yOffSet)</h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
The mouse is considered to be at (0, 0) initially, unless some other focus is declared.
Offset values are measured in pixels.
xOffset moves left for positive, right for negative values.  
yOffset moves down for positive, up for negative.
This throws MoveTargetOutOfBoundsException if you move the cursor out of the document.
</p>

<p>
In this example, we add 1 to the X and Y because the  the element has a 1 pixel border in the example page.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">MoveByOffSet</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    System.out.println(<span style="color: #A5C261;">"X coordinate: "</span>+three.getLocation().getX()
                       +<span style="color: #A5C261;">"  Y coordinate: "</span>+three.getLocation().getY());
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.moveByOffset(three.getLocation().getX()+1, three.getLocation().getY()+1);
    builder.perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">public Actions click()</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">MoveByOffsetAndClick</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">seven</span> = driver.findElement(By.name(<span style="color: #A5C261;">"seven"</span>));
    System.out.println(<span style="color: #A5C261;">"X coordinate: "</span>+seven.getLocation().getX()
                       +<span style="color: #A5C261;">" Y coordinate: "</span>+seven.getLocation().getY());
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.moveByOffset(seven.getLocation().getX()+1, seven.getLocation().getY()+1).click();
    builder.perform();
  }
}
</pre>
</div>

<p>
A more complex usage (which we see a much cleaner version of in click(onElement) desc) follows:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">MoveByOffsetAndClick</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">one</span> = driver.findElement(By.name(<span style="color: #A5C261;">"one"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">eleven</span> = driver.findElement(By.name(<span style="color: #A5C261;">"eleven"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">five</span> = driver.findElement(By.name(<span style="color: #A5C261;">"five"</span>));
    <span style="color: #6D9CBE;">int</span> <span style="color: #C8C8FF;">border</span> = 1;
    <span style="color: #6D9CBE;">int</span> <span style="color: #C8C8FF;">tileWidth</span> = 100;
    <span style="color: #6D9CBE;">int</span> <span style="color: #C8C8FF;">tileHeight</span> = 80;
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Click on One</span>
    builder.moveByOffset(one.getLocation().getX()+border, one.getLocation().getY()+border).click();
    builder.build().perform();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Click on Eleven</span>
    builder.moveByOffset(2*tileWidth+4*border, 2*tileHeight+4*border).click();
    builder.build().perform();
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Click on Five</span>
    builder.moveByOffset(-2*tileWidth-4*border,-tileHeight-2*border).click();
    builder.build().perform();
   }
 }
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">public Actions click(WebElement onElement)</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
This overloaded version directly clicks an element without having to work with offsets.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickOnWebElement</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">one</span> = driver.findElement(By.name(<span style="color: #A5C261;">"one"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">eleven</span> = driver.findElement(By.name(<span style="color: #A5C261;">"eleven"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">five</span> = driver.findElement(By.name(<span style="color: #A5C261;">"five"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Click on One</span>
    builder.click(one);
    builder.build().perform();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Click on Eleven</span>
    builder.click(eleven);
    builder.build().perform();
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Click on Five</span>
    builder.click(five)
    builder.build().perform();
  }
}
</pre>
</div>

<p>
This is a lot cleaner than the example in the click() method, and is a great reason to set 
identifiers for WebElements.  We can simplify this example yet again by building all the 
actions before performing them as follows:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickOnWebElement</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Selectable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">one</span> = driver.findElement(By.name(<span style="color: #A5C261;">"one"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">eleven</span> = driver.findElement(By.name(<span style="color: #A5C261;">"eleven"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">five</span> = driver.findElement(By.name(<span style="color: #A5C261;">"five"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Click on One, Eleven and Five</span>
    builder.click(one).click(eleven).click(five);
    builder.build().perform();
  }
}
</pre>
</div>
</div>
</div>
