books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** public Actions clickAndHold()
This is equivalent to clicking somewhere and holding down the mouse button.  You generally want
to move somewhere else afterwards to highlight a region.  You should use release at some point 
(likely very soon) after using this.

#+begin_src java
public class ClickAndHold{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Sortable.html");
    Actions builder = new Actions(driver);
    //Move tile3 to the position of tile2
    builder.moveByOffset(200, 20)
           .clickAndHold()
           .moveByOffset(120, 0)
           .perform();
  }
}
#+end_src
*** public Actions clickAndHold(WebElement onElement)
#+begin_src java
public class ClickAndHold{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Sortable.html");
    WebElement three = driver.findElement(By.name("three"));
    Actions builder = new Actions(driver);
    //Move tile3 to the position of tile2
    builder.clickAndHold(three)
           .moveByOffset(120, 0)
           .perform();
  }
}
#+end_src
*** public Actions release()
Note: using either of these release methods without calling clickAndHold() first results
in undefined behavior.

#+begin_src java
public class ClickAndHoldAndRelease{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Sortable.html");
    WebElement three = driver.findElement(By.name("three"));
    Actions builder = new Actions(driver);
    //Move tile3 to the position of tile2
    builder.clickAndHold(three)
           .moveByOffset(120, 0)
           .release()
           .perform();
  }
}
#+end_src
*** public Actions release(WebElement onElement)
Note: using either of these release methods without calling clickAndHold() first results
in undefined behavior.

#+begin_src java
public class ClickAndHoldAndReleaseOnWebElement{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/Sortable.html");
    WebElement three = driver.findElement(By.name("three"));
    WebElement two = driver.findElement(By.name("two"));
    Actions builder = new Actions(driver);
    //Move tile3 to the position of tile2
    builder.clickAndHold(three)
           .release(two)
           .perform();
  }
}
#+end_src
*** public Actions moveToElement(WebElement toElement)
Moves the mouse cursor to the specified element on the webpage.
#+begin_src java
  public class ClickAndHold{
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      driver.get("file://C:/Sortable.html");
      WebElement three = driver.findElement(By.name("three"));
      Actions builder = new Actions(driver);
      //Move tile3 to the position of tile2
      builder.moveToElement(three)
             .clickAndHold()
             .moveByOffset(120, 0)
             .release()
             .perform();
    }
  }
#+end_src
*** public Actions dragAndDropBy(WebElement source, int xOffset, int yOffset)
This drags and drops the source element by x,y pixels. 

Ex: Drag and drop elt where id=draggable by 300px horizontally, 200px vertically.
#+begin_src java
public class DragMe {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/DragMe.html");
    WebElement dragMe = driver.findElement(By.id("draggable"));
    Actions builder = new Actions(driver);
    builder.dragAndDropBy(dragMe, 300, 200).perform();
  }
}
#+end_src
*** public Actions dragAndDrop(WebElement source, WebElement target)
This drags and drops source element onto target element.

#+begin_src java
public class DragAndDrop {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/DragAndDrop.html");
    WebElement src = driver.findElement(By.id("draggable"));
    WebElement trgt = driver.findElement(By.id("droppable"));
    Actions builder = new Actions(driver);
    builder.dragAndDrop(src, trgt).perform();
  }
}
#+end_src
