books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">public Actions clickAndHold()</h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
This is equivalent to clicking somewhere and holding down the mouse button.  You generally want
to move somewhere else afterwards to highlight a region.  You should use release at some point 
(likely very soon) after using this.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickAndHold</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Sortable.html"</span>);
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Move tile3 to the position of tile2</span>
    builder.moveByOffset(200, 20)
           .clickAndHold()
           .moveByOffset(120, 0)
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-5" class="outline-4">
<h4 id="sec-5-2-5">public Actions clickAndHold(WebElement onElement)</h4>
<div class="outline-text-4" id="text-5-2-5">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickAndHold</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Sortable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Move tile3 to the position of tile2</span>
    builder.clickAndHold(three)
           .moveByOffset(120, 0)
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-6" class="outline-4">
<h4 id="sec-5-2-6">public Actions release()</h4>
<div class="outline-text-4" id="text-5-2-6">
<p>
Note: using either of these release methods without calling clickAndHold() first results
in undefined behavior.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickAndHoldAndRelease</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Sortable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Move tile3 to the position of tile2</span>
    builder.clickAndHold(three)
           .moveByOffset(120, 0)
           .release()
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-7" class="outline-4">
<h4 id="sec-5-2-7">public Actions release(WebElement onElement)</h4>
<div class="outline-text-4" id="text-5-2-7">
<p>
Note: using either of these release methods without calling clickAndHold() first results
in undefined behavior.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickAndHoldAndReleaseOnWebElement</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Sortable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">two</span> = driver.findElement(By.name(<span style="color: #A5C261;">"two"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Move tile3 to the position of tile2</span>
    builder.clickAndHold(three)
           .release(two)
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-8" class="outline-4">
<h4 id="sec-5-2-8">public Actions moveToElement(WebElement toElement)</h4>
<div class="outline-text-4" id="text-5-2-8">
<p>
Moves the mouse cursor to the specified element on the webpage.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ClickAndHold</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/Sortable.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">three</span> = driver.findElement(By.name(<span style="color: #A5C261;">"three"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    <span style="color: #BC9458;">//</span><span style="color: #BC9458;">Move tile3 to the position of tile2</span>
    builder.moveToElement(three)
           .clickAndHold()
           .moveByOffset(120, 0)
           .release()
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-9" class="outline-4">
<h4 id="sec-5-2-9">public Actions dragAndDropBy(WebElement source, int xOffset, int yOffset)</h4>
<div class="outline-text-4" id="text-5-2-9">
<p>
This drags and drops the source element by x,y pixels. 
</p>

<p>
Ex: Drag and drop elt where id=draggable by 300px horizontally, 200px vertically.
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">DragMe</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/DragMe.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">dragMe</span> = driver.findElement(By.id(<span style="color: #A5C261;">"draggable"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.dragAndDropBy(dragMe, 300, 200).perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-10" class="outline-4">
<h4 id="sec-5-2-10">public Actions dragAndDrop(WebElement source, WebElement target)</h4>
<div class="outline-text-4" id="text-5-2-10">
<p>
This drags and drops source element onto target element.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">DragAndDrop</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/DragAndDrop.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">src</span> = driver.findElement(By.id(<span style="color: #A5C261;">"draggable"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">trgt</span> = driver.findElement(By.id(<span style="color: #A5C261;">"droppable"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.dragAndDrop(src, trgt).perform();
  }
}
</pre>
</div>
</div>
</div>
