books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** public Actions doubleClick()
Double click whatever the mouse is over.

#+begin_src java
public class DoubleClick {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/DoubleClick.html");
    WebElement dblClick= driver.findElement(By.name("dblClick"));
    Actions builder = new Actions(driver);
    builder.moveToElement(dblClick).doubleClick().perform();
  }
}
#+end_src
*** public Actions doubleClick(WebElement onElement)
Often we want to doubleClick on some element.

#+begin_src java
public class DoubleClick {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/DoubleClick.html");
    WebElement dblClick = driver.findElement(By.name("dblClick"));
    Actions builder = new Actions(driver);
    builder.doubleClick(dblClick).perform();
  }
}
#+end_src
*** public Actions contextClick(WebElement onElement)
#+begin_src java
public class ContextClick {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/ContextClick.html");
    WebElement contextMenu = driver.findElement(By.id("div-context"));
    Actions builder = new Actions(driver);
    builder.contextClick(contextMenu)
       .click(driver.findElement(By.name("Item 4")))
           .perform();
  }
}
#+end_src
*** public Actions contextClick()
This moves to div-context, context clicks it (right click), then selects Item 4 from the 
list by name.

#+begin_src java
public class ContextClick {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("file://C:/ContextClick.html");
    WebElement contextMenu = driver.findElement(By.id("div-context"));
    Actions builder = new Actions(driver);
    builder.moveToElement(contextMenu)
           .contextClick()
           .click(driver.findElement(By.name("Item 4")))
           .perform();
  }
}
#+end_src
** Keyboard-based interactions
*** public Actions keyDown(Keys theKey) throws IllegalArgumentException
The only legal arguments are one of Shift, Ctrl, and Alt
*** public Actions keyUp(Keys theKey)
Causes unexpected results if we have not already held the key down
*** public Actions sendKeys(CharSequence keysToSend)
* Waiting for WebElements to load
** Implicit Wait Time
Used to configure wait time for all get/find operations of application under test.
The driver throws NoSuchElementException when time is exceeded.

#+begin_src java
public class ImplicitWaitTime {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.manage().timeouts().implicitlyWait(10,   TimeUnit.SECONDS);
    driver.get("www.google.com");
  }
}
#+end_src
** Explicit Wait Time
Sometimes you have a single element you want to wait longer for, so you set an explicit wait time.

#+begin_src java
public class ExplicitWaitTime {
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.google.com");
    WebElement element = (new WebDriverWait(driver, 20)).until(new ExpectedCondition<WebElement>() { 
       @Override
       public WebElement apply(WebDriver d) {
         return d.findElement(By.name("q"));
       }
     });
  }
}
#+end_src
* Windows and iFrames
