books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-5-2-11" class="outline-4">
<h4 id="sec-5-2-11">public Actions doubleClick()</h4>
<div class="outline-text-4" id="text-5-2-11">
<p>
Double click whatever the mouse is over.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">DoubleClick</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/DoubleClick.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">dblClick</span>= driver.findElement(By.name(<span style="color: #A5C261;">"dblClick"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.moveToElement(dblClick).doubleClick().perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-12" class="outline-4">
<h4 id="sec-5-2-12">public Actions doubleClick(WebElement onElement)</h4>
<div class="outline-text-4" id="text-5-2-12">
<p>
Often we want to doubleClick on some element.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">DoubleClick</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/DoubleClick.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">dblClick</span> = driver.findElement(By.name(<span style="color: #A5C261;">"dblClick"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.doubleClick(dblClick).perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-13" class="outline-4">
<h4 id="sec-5-2-13">public Actions contextClick(WebElement onElement)</h4>
<div class="outline-text-4" id="text-5-2-13">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ContextClick</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/ContextClick.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">contextMenu</span> = driver.findElement(By.id(<span style="color: #A5C261;">"div-context"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.contextClick(contextMenu)
       .click(driver.findElement(By.name(<span style="color: #A5C261;">"Item 4"</span>)))
           .perform();
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-14" class="outline-4">
<h4 id="sec-5-2-14">public Actions contextClick()</h4>
<div class="outline-text-4" id="text-5-2-14">
<p>
This moves to div-context, context clicks it (right click), then selects Item 4 from the 
list by name.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ContextClick</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"file://C:/ContextClick.html"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">contextMenu</span> = driver.findElement(By.id(<span style="color: #A5C261;">"div-context"</span>));
    <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
    builder.moveToElement(contextMenu)
           .contextClick()
           .click(driver.findElement(By.name(<span style="color: #A5C261;">"Item 4"</span>)))
           .perform();
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3">Keyboard-based interactions</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1">public Actions keyDown(Keys theKey) throws IllegalArgumentException</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
The only legal arguments are one of Shift, Ctrl, and Alt
</p>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2">public Actions keyUp(Keys theKey)</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Causes unexpected results if we have not already held the key down
</p>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3">public Actions sendKeys(CharSequence keysToSend)</h4>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Waiting for WebElements to load</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1">Implicit Wait Time</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Used to configure wait time for all get/find operations of application under test.
The driver throws NoSuchElementException when time is exceeded.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ImplicitWaitTime</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.manage().timeouts().implicitlyWait(10,   <span style="color: #6D9CBE;">TimeUnit</span>.SECONDS);
    driver.get(<span style="color: #A5C261;">"www.google.com"</span>);
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2">Explicit Wait Time</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Sometimes you have a single element you want to wait longer for, so you set an explicit wait time.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">ExplicitWaitTime</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span> = (<span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">WebDriverWait</span>(driver, 20)).until(<span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">ExpectedCondition</span>&lt;<span style="color: #6D9CBE;">WebElement</span>&gt;() { 
       <span style="color: #6D9CBE;">@Override</span>
       <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">WebElement</span> <span style="color: #FFC66D;">apply</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">d</span>) {
         <span style="color: #CC7833;">return</span> d.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
       }
     });
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Windows and iFrames</h2>
