books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
** Multiple Windows
String window1 = driver.getWindowHandle();  // store a handle for the current window
driver.switchTo().window(window1);          // switch back to the window
driver.getWindowHandles();                  // returns all window handles opened by driver so far
Ex:
#+begin_src java
public class WindowHandling {
   public static void main(String... args){
      WebDriver driver = new FirefoxDriver();
      driver.get("file://C:/Window.html");

      String window1 = driver.getWindowHandle();
      System.out.println("First Window Handle is: "+window1);

      WebElement link = driver.findElement(By.linkText("Google Search"));
      link.click();

      String window2 = driver.getWindowHandle();
      System.out.println("Second Window Handle is: "+window2);
      System.out.println("Number of Window Handles so for: "
            +driver.getWindowHandles().size());

      driver.switchTo().window(window1);
   }
}
#+end_src
** Multiple Frames
driver.switchTo().frame(int index);
driver.switchTo().frame(Strign frameNameOrFrameId);
driver.switchTo().frame(WebElement frameElement);
driver.switchTo().defaultContent();  // you need to use before switching to another frame!

#+begin_src java
public class SwitchBetweenFrames {
   public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      driver.get("file://C:/Frames.html");

      Actions action = new Actions(driver);

      driver.switchTo().frame(0);
      WebElement txt = driver.findElement(By.name("1"));
      txt.sendKeys("I'm Frame One");

      driver.switchTo().defaultContent();

      driver.switchTo().frame(1);
      txt = driver.findElement(By.name("2"));
      txt.sendKeys("I'm Frame Two");
   }
}
#+end_src
** Handling Alerts is covered under special capabilities.
* Navigation
Navigate allows WebDriver to use native browse Back/Forward/Refresh, among other things.
WebDriver.Navigation navigate() allows us to get an object to use these features.

#+begin_src java
public class WebDriverNavigate{
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.navigate().to("http://www.google.com");
    
    WebElement searchBox = driver.findElement(By.name("q"));
    searchBox.sendKeys("Selenium WebDriver");
    WebElement searchButton = driver.findElement(By.name("btnG"));
    searchButton.click();
    searchBox.clear();
    searchBox.sendKeys("Packt Publishing");
    searchButton.click();

    driver.navigate().back();
    driver.navigate().forward();
    driver.navigate().refresh();
  }
}
#+end_src
** Navigation object methods
#+begin_src java
void driver.navigate().to(String url);
void driver.navigate().back();
void driver.navigate().forward();
void driver.navigate().refresh();
#+end_src
* Cookies
** Fetching all loaded cookies for a page: driver.manage().getCookies();
Full program to store all current session cookie information to a 'browser.data' file

#+begin_src java
package com.packt.webdriver.chapter3;

import java.io.BufferedWriter;
import java.io.File;
import java.io.FileWriter;

import org.openqa.selenium.By;
import org.openqa.selenium.Cookie;
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.firefox.FirefoxDriver;

public class StoreCookieInfo {
  
  public static void main(String... args) {
    WebDriver driver = new FirefoxDriver();
    driver.get("http://www.facebook.com");
    driver.findElement(By.name("email")).sendKeys("<<ur mailID>>");
    driver.findElement(By.name("pass")).sendKeys("<<ur password>>");
    driver.findElement(By.name("persistent")).click();
    driver.findElement(By.name("pass")).submit();

    File f = new File("browser.data");
    try{
         f.delete();
         f.createNewFile();
         FileWriter fos = new FileWriter(f);
         BufferedWriter bos = new BufferedWriter(fos);

         for(Cookie ck : driver.manage().getCookies()) {
           bos.write((ck.getName()+";"+ck.getValue()+";"+ck.getDomain()
                      +";"+ck.getPath()+";"+ck.getExpiry()+";"+ck.isSecure()));
           bos.newLine();
         }
         bos.flush();
         bos.close();
         fos.close();
     } catch(Exception ex){
         ex.printStackTrace();
     }
  }
}
#+end_src
