books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">Multiple Windows</h3>
<div class="outline-text-3" id="text-7-1">
<p>
String window1 = driver.getWindowHandle();  <i>/ store a handle for the current window
driver.switchTo().window(window1);          /</i> switch back to the window
driver.getWindowHandles();                  // returns all window handles opened by driver so far
Ex:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">WindowHandling</span> {
   <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
      <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
      driver.get(<span style="color: #A5C261;">"file://C:/Window.html"</span>);

      <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">window1</span> = driver.getWindowHandle();
      System.out.println(<span style="color: #A5C261;">"First Window Handle is: "</span>+window1);

      <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">link</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"Google Search"</span>));
      link.click();

      <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">window2</span> = driver.getWindowHandle();
      System.out.println(<span style="color: #A5C261;">"Second Window Handle is: "</span>+window2);
      System.out.println(<span style="color: #A5C261;">"Number of Window Handles so for: "</span>
            +driver.getWindowHandles().size());

      driver.switchTo().window(window1);
   }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">Multiple Frames</h3>
<div class="outline-text-3" id="text-7-2">
<p>
driver.switchTo().frame(int index);
driver.switchTo().frame(Strign frameNameOrFrameId);
driver.switchTo().frame(WebElement frameElement);
driver.switchTo().defaultContent();  // you need to use before switching to another frame!
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">SwitchBetweenFrames</span> {
   <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
      <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
      driver.get(<span style="color: #A5C261;">"file://C:/Frames.html"</span>);

      <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">action</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);

      driver.switchTo().frame(0);
      <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">txt</span> = driver.findElement(By.name(<span style="color: #A5C261;">"1"</span>));
      txt.sendKeys(<span style="color: #A5C261;">"I'm Frame One"</span>);

      driver.switchTo().defaultContent();

      driver.switchTo().frame(1);
      txt = driver.findElement(By.name(<span style="color: #A5C261;">"2"</span>));
      txt.sendKeys(<span style="color: #A5C261;">"I'm Frame Two"</span>);
   }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">Handling Alerts is covered under special capabilities.</h3>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Navigation</h2>
<div class="outline-text-2" id="text-8">
<p>
Navigate allows WebDriver to use native browse Back/Forward/Refresh, among other things.
WebDriver.Navigation navigate() allows us to get an object to use these features.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">WebDriverNavigate</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.navigate().to(<span style="color: #A5C261;">"http://www.google.com"</span>);

    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchBox</span> = driver.findElement(By.name(<span style="color: #A5C261;">"q"</span>));
    searchBox.sendKeys(<span style="color: #A5C261;">"Selenium WebDriver"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchButton</span> = driver.findElement(By.name(<span style="color: #A5C261;">"btnG"</span>));
    searchButton.click();
    searchBox.clear();
    searchBox.sendKeys(<span style="color: #A5C261;">"Packt Publishing"</span>);
    searchButton.click();

    driver.navigate().back();
    driver.navigate().forward();
    driver.navigate().refresh();
  }
}
</pre>
</div>
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">Navigation object methods</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #6D9CBE;">void</span> driver.<span style="color: #FFC66D;">navigate</span>().to(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">url</span>);
<span style="color: #6D9CBE;">void</span> driver.<span style="color: #FFC66D;">navigate</span>().back();
<span style="color: #6D9CBE;">void</span> driver.<span style="color: #FFC66D;">navigate</span>().forward();
<span style="color: #6D9CBE;">void</span> driver.<span style="color: #FFC66D;">navigate</span>().refresh();
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Cookies</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1">Fetching all loaded cookies for a page: driver.manage().getCookies();</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Full program to store all current session cookie information to a 'browser.data' file
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.webdriver.<span style="color: #6D9CBE;">chapter3</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">BufferedWriter</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">File</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">FileWriter</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">By</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">Cookie</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">StoreCookieInfo</span> {

  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.facebook.com"</span>);
    driver.findElement(By.name(<span style="color: #A5C261;">"email"</span>)).sendKeys(<span style="color: #A5C261;">"&lt;&lt;ur mailID&gt;&gt;"</span>);
    driver.findElement(By.name(<span style="color: #A5C261;">"pass"</span>)).sendKeys(<span style="color: #A5C261;">"&lt;&lt;ur password&gt;&gt;"</span>);
    driver.findElement(By.name(<span style="color: #A5C261;">"persistent"</span>)).click();
    driver.findElement(By.name(<span style="color: #A5C261;">"pass"</span>)).submit();

    <span style="color: #6D9CBE;">File</span> <span style="color: #C8C8FF;">f</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">File</span>(<span style="color: #A5C261;">"browser.data"</span>);
    <span style="color: #CC7833;">try</span>{
         f.delete();
         f.createNewFile();
         <span style="color: #6D9CBE;">FileWriter</span> <span style="color: #C8C8FF;">fos</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FileWriter</span>(f);
         <span style="color: #6D9CBE;">BufferedWriter</span> <span style="color: #C8C8FF;">bos</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">BufferedWriter</span>(fos);

         <span style="color: #CC7833;">for</span>(<span style="color: #6D9CBE;">Cookie</span> <span style="color: #C8C8FF;">ck</span> : driver.manage().getCookies()) {
           bos.write((ck.getName()+<span style="color: #A5C261;">";"</span>+ck.getValue()+<span style="color: #A5C261;">";"</span>+ck.getDomain()
                      +<span style="color: #A5C261;">";"</span>+ck.getPath()+<span style="color: #A5C261;">";"</span>+ck.getExpiry()+<span style="color: #A5C261;">";"</span>+ck.isSecure()));
           bos.newLine();
         }
         bos.flush();
         bos.close();
         fos.close();
     } <span style="color: #CC7833;">catch</span>(<span style="color: #6D9CBE;">Exception</span> <span style="color: #C8C8FF;">ex</span>){
         ex.printStackTrace();
     }
  }
}
</pre>
</div>
</div>
</div>
