books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
** Load a stored cookied: driver.manage().addCookie(ck);
#+begin_src java
package com.packt.webdriver.chapter3;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileReader;
import java.util.Date;
import java.util.StringTokenizer;

import org.openqa.selenium.Cookie;
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.firefox.FirefoxDriver;

public class LoadCookieInfo {

   public static void main(String... args){
      WebDriver driver = new FirefoxDriver();
      driver.get("http://www.facebook.com");
      try{
           File f = new File("browser.data");
           FileReader fr = new FileReader(f2);
           BufferedReader br = new BufferedReader(fr);
           String line;
           while((line=br.readLine())!=null){
               StringTokenizer str = new StringTokenizer(line,";");
               while(str.hasMoreTokens()){
                   String name = str.nextToken();
                   String value = str.nextToken();
                   String domain = str.nextToken();
                   String path = str.nextToken();
                   Date expiry = null;
                   String dt;
                   if(!(dt=str.nextToken()).equals("null")){
                       expiry = new Date(dt);
                   }
                   boolean isSecure = new Boolean(str.nextToken()).booleanValue();
                   Cookie ck = new Cookie(name,value,domain,path,expiry,isSecure);
                   driver.manage().addCookie(ck);
               }
           }
      }catch(Exception ex){
           ex.printStackTrace();
      }
      driver.get("http://www.facebook.com");
   }
}
#+end_src

The two driver.get calls above are necessary, since you need to go to the site, 
then load the cookies for the site, then reload the site.  
* Special capabilities
** Adding Capabilities to the WebDriver
Capabilities is an interface implemented in the DesiredCapabilities class

#+begin_src java
  public class BrowserCapabilities {
    public static void main(String... args) {
      Map capabilitiesMap = new HashMap();
      capabilitiesMap.put("takesScreenShot", true);
      DesiredCapabilities capabilities 
                 = new DesiredCapabilities(capabilitiesMap);
      WebDriver driver = new FirefoxDriver(capabilities);
      driver.get("http://www.google.com");
    }
  }
#+end_src
** Common capabilities
*** takesScreenShot
*** handlesAlert
*** cssSelectorsEnabled
*** javascriptEnabled
*** acceptSSLCerts
*** webStorageEnabled
** Using special capabilities
*** Screenshots
**** Enabling
#+begin_src java
  public class BrowserCapabilities {
    public static void main(String... args) {
      Map capabilitiesMap = new HashMap();
      capabilitiesMap.put("takesScreenShot", true);
      DesiredCapabilities capabilities 
                 = new DesiredCapabilities(capabilitiesMap);
      WebDriver driver = new FirefoxDriver(capabilities);
      driver.get("http://www.google.com");
    }
  }
#+end_src
**** API
public <X> X getScreenshotAs(OutputType<X> target)

Output type is one of: OutputType.BASE64, OutputType.BYTES (raw data), OutputType.FILE
**** Using
#+begin_src java
  public class TakesScreenShotExample{
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      driver.get("http://www.packtpub.com/");
      File scrFile = ((TakesScreenShot)driver).getScreenshotAs(OutputType.FILE);
      System.out.println(scrFile.getAbsolutePath());
      try {
        FileHandler.copy(scrFile, new File("C:\\Dest\\"));
      } catch (IOException e) {
        e.printStackTrace();
      }
    }
  }
#+end_src
