books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2">Load a stored cookied: driver.manage().addCookie(ck);</h3>
<div class="outline-text-3" id="text-9-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.webdriver.<span style="color: #6D9CBE;">chapter3</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">BufferedReader</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">File</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">io</span>.<span style="color: #6D9CBE;">FileReader</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">util</span>.<span style="color: #6D9CBE;">Date</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">util</span>.<span style="color: #6D9CBE;">StringTokenizer</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">Cookie</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">LoadCookieInfo</span> {

   <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
      <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
      driver.get(<span style="color: #A5C261;">"http://www.facebook.com"</span>);
      <span style="color: #CC7833;">try</span>{
           <span style="color: #6D9CBE;">File</span> <span style="color: #C8C8FF;">f</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">File</span>(<span style="color: #A5C261;">"browser.data"</span>);
           <span style="color: #6D9CBE;">FileReader</span> <span style="color: #C8C8FF;">fr</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FileReader</span>(f2);
           <span style="color: #6D9CBE;">BufferedReader</span> <span style="color: #C8C8FF;">br</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">BufferedReader</span>(fr);
           <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">line</span>;
           <span style="color: #CC7833;">while</span>((line=br.readLine())!=<span style="color: #6D9CBE;">null</span>){
               <span style="color: #6D9CBE;">StringTokenizer</span> <span style="color: #C8C8FF;">str</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">StringTokenizer</span>(line,<span style="color: #A5C261;">";"</span>);
               <span style="color: #CC7833;">while</span>(str.hasMoreTokens()){
                   <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">name</span> = str.nextToken();
                   <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">value</span> = str.nextToken();
                   <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">domain</span> = str.nextToken();
                   <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">path</span> = str.nextToken();
                   <span style="color: #6D9CBE;">Date</span> <span style="color: #C8C8FF;">expiry</span> = <span style="color: #6D9CBE;">null</span>;
                   <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">dt</span>;
                   <span style="color: #CC7833;">if</span>(!(dt=str.nextToken()).equals(<span style="color: #A5C261;">"null"</span>)){
                       expiry = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Date</span>(dt);
                   }
                   <span style="color: #6D9CBE;">boolean</span> <span style="color: #C8C8FF;">isSecure</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Boolean</span>(str.nextToken()).booleanValue();
                   <span style="color: #6D9CBE;">Cookie</span> <span style="color: #C8C8FF;">ck</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Cookie</span>(name,value,domain,path,expiry,isSecure);
                   driver.manage().addCookie(ck);
               }
           }
      }<span style="color: #CC7833;">catch</span>(<span style="color: #6D9CBE;">Exception</span> <span style="color: #C8C8FF;">ex</span>){
           ex.printStackTrace();
      }
      driver.get(<span style="color: #A5C261;">"http://www.facebook.com"</span>);
   }
}
</pre>
</div>

<p>
The two driver.get calls above are necessary, since you need to go to the site, 
then load the cookies for the site, then reload the site.  
</p>
</div>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">Special capabilities</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1">Adding Capabilities to the WebDriver</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Capabilities is an interface implemented in the DesiredCapabilities class
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">BrowserCapabilities</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">Map</span> <span style="color: #C8C8FF;">capabilitiesMap</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">HashMap</span>();
    capabilitiesMap.put(<span style="color: #A5C261;">"takesScreenShot"</span>, <span style="color: #6D9CBE;">true</span>);
    <span style="color: #6D9CBE;">DesiredCapabilities</span> <span style="color: #C8C8FF;">capabilities</span> 
               = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">DesiredCapabilities</span>(capabilitiesMap);
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(capabilities);
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2">Common capabilities</h3>
<div class="outline-text-3" id="text-10-2">
</div><div id="outline-container-sec-10-2-1" class="outline-4">
<h4 id="sec-10-2-1">takesScreenShot</h4>
</div>
<div id="outline-container-sec-10-2-2" class="outline-4">
<h4 id="sec-10-2-2">handlesAlert</h4>
</div>
<div id="outline-container-sec-10-2-3" class="outline-4">
<h4 id="sec-10-2-3">cssSelectorsEnabled</h4>
</div>
<div id="outline-container-sec-10-2-4" class="outline-4">
<h4 id="sec-10-2-4">javascriptEnabled</h4>
</div>
<div id="outline-container-sec-10-2-5" class="outline-4">
<h4 id="sec-10-2-5">acceptSSLCerts</h4>
</div>
<div id="outline-container-sec-10-2-6" class="outline-4">
<h4 id="sec-10-2-6">webStorageEnabled</h4>
</div>
</div>
<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3">Using special capabilities</h3>
<div class="outline-text-3" id="text-10-3">
</div><div id="outline-container-sec-10-3-1" class="outline-4">
<h4 id="sec-10-3-1">Screenshots</h4>
<div class="outline-text-4" id="text-10-3-1">
</div><ul class="org-ul"><li><a id="sec-10-3-1-1" name="sec-10-3-1-1"></a>Enabling<br  /><div class="outline-text-5" id="text-10-3-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">BrowserCapabilities</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">Map</span> <span style="color: #C8C8FF;">capabilitiesMap</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">HashMap</span>();
    capabilitiesMap.put(<span style="color: #A5C261;">"takesScreenShot"</span>, <span style="color: #6D9CBE;">true</span>);
    <span style="color: #6D9CBE;">DesiredCapabilities</span> <span style="color: #C8C8FF;">capabilities</span> 
               = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">DesiredCapabilities</span>(capabilitiesMap);
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(capabilities);
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
  }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-10-3-1-2" name="sec-10-3-1-2"></a>API<br  /><div class="outline-text-5" id="text-10-3-1-2">
<p>
public &lt;X&gt; X getScreenshotAs(OutputType&lt;X&gt; target)
</p>

<p>
Output type is one of: OutputType.BASE64, OutputType.BYTES (raw data), OutputType.FILE
</p>
</div>
</li>
<li><a id="sec-10-3-1-3" name="sec-10-3-1-3"></a>Using<br  /><div class="outline-text-5" id="text-10-3-1-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TakesScreenShotExample</span>{
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    driver.get(<span style="color: #A5C261;">"http://www.packtpub.com/"</span>);
    <span style="color: #6D9CBE;">File</span> <span style="color: #C8C8FF;">scrFile</span> = ((<span style="color: #6D9CBE;">TakesScreenShot</span>)driver).getScreenshotAs(<span style="color: #6D9CBE;">OutputType</span>.FILE);
    System.out.println(scrFile.getAbsolutePath());
    <span style="color: #CC7833;">try</span> {
      FileHandler.copy(scrFile, <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">File</span>(<span style="color: #A5C261;">"C:\\Dest\\"</span>));
    } <span style="color: #CC7833;">catch</span> (<span style="color: #6D9CBE;">IOException</span> <span style="color: #C8C8FF;">e</span>) {
      e.printStackTrace();
    }
  }
}
</pre>
</div>
</div>
</li>
