books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
**** Warning
The file returned for OutputType.FILE is temporarily and is deleted once the JVM exits, so 
you will need to copy the file somewhere before the test completes.
**** Browser dependency
The method tries to take as large a screenshot as possible, but what it can actually do is
dependent upon the browser.  In Firefox, the screenshot will be of the entire page.  In 
Chrome, it will take a picture of the visibile area.
*** Handling alerts
**** Enabling
#+begin_src java
  public class BrowserCapabilities {
    public static void main(String... args) {
      Map capabilitiesMap = new HashMap();
      capabilitiesMap.put("handlesAlert", true);
      DesiredCapabilities capabilities 
                 = new DesiredCapabilities(capabilitiesMap);
      WebDriver driver = new FirefoxDriver(capabilities);
      driver.get("http://www.google.com");
    }
  }
#+end_src
**** API
Alert alert(): switch to currently active modal dialog on the page or throw NoAlertPresentException

# The alert object has the following methods for interaction
void accept(): equivalent to OK on dialog
void dismiss(): equivalent to CANCEL
String getText(): return text in dialog
void sendKeys(String keysToSend): type text into alert
* Firefox Specific Features
** Using a specific Firefox Profile
The driver creates a new anonymous profile each time it launches a browser.  Instead, we can use a specific
profile with a FirefoxProfile object:  public FirefoxProfile(java.io.File profileDir)

#+begin_src java
public class FirefoxCustomProfile {  
  public static void main(String... args){
    FirefoxProfile profile = new FirefoxProfile();
    
    FirefoxDriver driver = new FirefoxDriver(profile);
    driver.get("http://www.google.com");		
  }
}
#+end_src
** Installing a browser extension in the WebDriver profile
Profile objects have an addExtension method.  It will throw IOException if it cannot find the file.

#+begin_src java
public class AddExtensionToProfile {
  public static void main(String... args){
    FirefoxProfile profile = new FirefoxProfile();
    
    try {
      profile.addExtension(new File("C:\\firebug-1.12.0-fx.xpi"));
    } catch (IOException e) {
      e.printStackTrace();
    }
    
    FirefoxDriver driver = new FirefoxDriver(profile);		
  }
}
#+end_src
** Setting Profile Preferences
#+begin_src java
public class SettingPreferences {
  public static void main(String... args){
    FirefoxProfile profile = new FirefoxProfile();
    
    profile.setPreference("general.useragent.override", "Mozilla/5.0 (iPhone; U; CPU iPhone OS 4_0 like Mac OS X; en-us) AppleWebKit/532.9 (KHTML, like Gecko) Version/4.0.5 Mobile/8A293 Safari/6531.22.7");
    
    FirefoxDriver driver = new FirefoxDriver(profile);
    driver.get("http://www.google.com");		
  }
}
#+end_src
* Testing with Custom Events
The "How" seems well explained...  When/Why?

** Flow of Setting up to Capture Events during Test Execution
1) Create an EventListener Class
2) Create a WebDriver instance
3) Create an instance of EventFiringWebDriver to wrap the WebDriver
4) Create an instance of EventListener class created above
5) Register the EventListener with the EventFiringWebDriver
6) Execute the events with the EventFiringWebDriver
7) Verify Listener got informed of events occurence
** Creating an instance of EventListener (done one of two ways)
You can do this either way, and experience will help you choose which might be easiest for a situation
