books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<li><a id="sec-10-3-1-4" name="sec-10-3-1-4"></a>Warning<br  /><div class="outline-text-5" id="text-10-3-1-4">
<p>
The file returned for OutputType.FILE is temporarily and is deleted once the JVM exits, so 
you will need to copy the file somewhere before the test completes.
</p>
</div>
</li>
<li><a id="sec-10-3-1-5" name="sec-10-3-1-5"></a>Browser dependency<br  /><div class="outline-text-5" id="text-10-3-1-5">
<p>
The method tries to take as large a screenshot as possible, but what it can actually do is
dependent upon the browser.  In Firefox, the screenshot will be of the entire page.  In 
Chrome, it will take a picture of the visibile area.
</p>
</div>
</li></ul>
</div>
<div id="outline-container-sec-10-3-2" class="outline-4">
<h4 id="sec-10-3-2">Handling alerts</h4>
<div class="outline-text-4" id="text-10-3-2">
</div><ul class="org-ul"><li><a id="sec-10-3-2-1" name="sec-10-3-2-1"></a>Enabling<br  /><div class="outline-text-5" id="text-10-3-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">BrowserCapabilities</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">Map</span> <span style="color: #C8C8FF;">capabilitiesMap</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">HashMap</span>();
    capabilitiesMap.put(<span style="color: #A5C261;">"handlesAlert"</span>, <span style="color: #6D9CBE;">true</span>);
    <span style="color: #6D9CBE;">DesiredCapabilities</span> <span style="color: #C8C8FF;">capabilities</span> 
               = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">DesiredCapabilities</span>(capabilitiesMap);
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(capabilities);
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
  }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-10-3-2-2" name="sec-10-3-2-2"></a>API<br  /><div class="outline-text-5" id="text-10-3-2-2">
<p>
Alert alert(): switch to currently active modal dialog on the page or throw NoAlertPresentException
</p>

<p>
void accept(): equivalent to OK on dialog
void dismiss(): equivalent to CANCEL
String getText(): return text in dialog
void sendKeys(String keysToSend): type text into alert
</p>
</div>
</li></ul>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">Firefox Specific Features</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1">Using a specific Firefox Profile</h3>
<div class="outline-text-3" id="text-11-1">
<p>
The driver creates a new anonymous profile each time it launches a browser.  Instead, we can use a specific
profile with a FirefoxProfile object:  public FirefoxProfile(java.io.File profileDir)
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">FirefoxCustomProfile</span> {  
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">FirefoxProfile</span> <span style="color: #C8C8FF;">profile</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxProfile</span>();

    <span style="color: #6D9CBE;">FirefoxDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(profile);
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);                
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2">Installing a browser extension in the WebDriver profile</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Profile objects have an addExtension method.  It will throw IOException if it cannot find the file.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AddExtensionToProfile</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">FirefoxProfile</span> <span style="color: #C8C8FF;">profile</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxProfile</span>();

    <span style="color: #CC7833;">try</span> {
      profile.addExtension(<span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">File</span>(<span style="color: #A5C261;">"C:\\firebug-1.12.0-fx.xpi"</span>));
    } <span style="color: #CC7833;">catch</span> (<span style="color: #6D9CBE;">IOException</span> <span style="color: #C8C8FF;">e</span>) {
      e.printStackTrace();
    }

    <span style="color: #6D9CBE;">FirefoxDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(profile);          
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3">Setting Profile Preferences</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">SettingPreferences</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">FirefoxProfile</span> <span style="color: #C8C8FF;">profile</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxProfile</span>();

    profile.setPreference(<span style="color: #A5C261;">"general.useragent.override"</span>, <span style="color: #A5C261;">"Mozilla/5.0 (iPhone; U; CPU iPhone OS 4_0 like Mac OS X; en-us) AppleWebKit/532.9 (KHTML, like Gecko) Version/4.0.5 Mobile/8A293 Safari/6531.22.7"</span>);

    <span style="color: #6D9CBE;">FirefoxDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>(profile);
    driver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);                
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">Testing with Custom Events</h2>
<div class="outline-text-2" id="text-12">
<p>
The "How" seems well explained&#x2026;  When/Why?
</p>
</div>

<div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1">Flow of Setting up to Capture Events during Test Execution</h3>
<div class="outline-text-3" id="text-12-1">
<ol class="org-ol">
<li>Create an EventListener Class
</li>
<li>Create a WebDriver instance
</li>
<li>Create an instance of EventFiringWebDriver to wrap the WebDriver
</li>
<li>Create an instance of EventListener class created above
</li>
<li>Register the EventListener with the EventFiringWebDriver
</li>
<li>Execute the events with the EventFiringWebDriver
</li>
<li>Verify Listener got informed of events occurence
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2">Creating an instance of EventListener (done one of two ways)</h3>
<div class="outline-text-3" id="text-12-2">
<p>
You can do this either way, and experience will help you choose which might be easiest for a situation
</p>
</div>
