books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** Implementing WebDriverEventListener (more verbose)
Requires you to implement the 15 methods declared in the WebDriverEventListener interface

#+begin_src java
public class IAmTheEventListener implements WebDriverEventListener{
   
////////// NAVIGATION RELATED METHODS ////////////////
   @Override
   public void beforeNavigateTo(String url, WebDriver driver) {
      System.out.println("Before Navigate To "+url);
   }

   @Override
   public void afterNavigateTo(String url, WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void beforeNavigateBack(WebDriver driver) {
      System.out.println("Before Navigate Back. Right now I'm at "+driver.getCurrentUrl());
   }

   @Override
   public void afterNavigateBack(WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void beforeNavigateForward(WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void afterNavigateForward(WebDriver driver) {
      // TODO Auto-generated method stub
   }

/////////////////// FINDBY RELATED METHODS ///////////////
   @Override
   public void beforeFindBy(By by, WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void afterFindBy(By by, WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

//////////////////// CLICKON RELATED METHODS ///////////////
   @Override
   public void beforeClickOn(WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void afterClickOn(WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

///////////////// CHANGE OF VALUE RELATED METHODS //////////////
   @Override
   public void beforeChangeValueOf(WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void afterChangeValueOf(WebElement element, WebDriver driver) {
      // TODO Auto-generated method stub
   }

/////////////// SCRIPT EXECUTION RELATED METHODS ///////////////
   @Override
   public void beforeScript(String script, WebDriver driver) {
      // TODO Auto-generated method stub
   }

   @Override
   public void afterScript(String script, WebDriver driver) {
      // TODO Auto-generated method stub
   }

/////////////// EXCEPTION RELATED METHODS ///////////////////////
   @Override
   public void onException(Throwable throwable, WebDriver driver) {
      // TODO Auto-generated method stub
   }
}
#+end_src
*** Extending the AbstractWebDriverEventListener
Dummy implementations of all 15 methods in the above interface are provided, so you only have to 
override the methods you are interested in.

#+begin_src java
public class IAmTheEventListener2 extends AbstractWebDriverEventListener{

   @Override
   public void beforeNavigateTo(String url, WebDriver driver) {
      System.out.println("Before Navigate To "+url);
   }

   @Override
   public void beforeNavigateBack(WebDriver driver) {
      System.out.println("Before Navigate Back. Right now I'm at "+driver.getCurrentUrl());
   }
}
#+end_src
