books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-12-2-1" class="outline-4">
<h4 id="sec-12-2-1">Implementing WebDriverEventListener (more verbose)</h4>
<div class="outline-text-4" id="text-12-2-1">
<p>
Requires you to implement the 15 methods declared in the WebDriverEventListener interface
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">IAmTheEventListener</span> <span style="color: #CC7833;">implements</span> <span style="color: #6D9CBE;">WebDriverEventListener</span>{

<span style="color: #BC9458;">////////// </span><span style="color: #BC9458;">NAVIGATION RELATED METHODS ////////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateTo</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">url</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      System.out.println(<span style="color: #A5C261;">"Before Navigate To "</span>+url);
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterNavigateTo</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">url</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateBack</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      System.out.println(<span style="color: #A5C261;">"Before Navigate Back. Right now I'm at "</span>+driver.getCurrentUrl());
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterNavigateBack</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateForward</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterNavigateForward</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

<span style="color: #BC9458;">/////////////////// </span><span style="color: #BC9458;">FINDBY RELATED METHODS ///////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeFindBy</span>(<span style="color: #6D9CBE;">By</span> <span style="color: #C8C8FF;">by</span>, <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterFindBy</span>(<span style="color: #6D9CBE;">By</span> <span style="color: #C8C8FF;">by</span>, <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

<span style="color: #BC9458;">//////////////////// </span><span style="color: #BC9458;">CLICKON RELATED METHODS ///////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeClickOn</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterClickOn</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

<span style="color: #BC9458;">///////////////// </span><span style="color: #BC9458;">CHANGE OF VALUE RELATED METHODS //////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeChangeValueOf</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterChangeValueOf</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">element</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

<span style="color: #BC9458;">/////////////// </span><span style="color: #BC9458;">SCRIPT EXECUTION RELATED METHODS ///////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeScript</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">script</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">afterScript</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">script</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }

<span style="color: #BC9458;">/////////////// </span><span style="color: #BC9458;">EXCEPTION RELATED METHODS ///////////////////////</span>
   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">onException</span>(<span style="color: #6D9CBE;">Throwable</span> <span style="color: #C8C8FF;">throwable</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      <span style="color: #BC9458;">// </span><span style="color: #BC9458;">TODO Auto-generated method stub</span>
   }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-12-2-2" class="outline-4">
<h4 id="sec-12-2-2">Extending the AbstractWebDriverEventListener</h4>
<div class="outline-text-4" id="text-12-2-2">
<p>
Dummy implementations of all 15 methods in the above interface are provided, so you only have to 
override the methods you are interested in.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">IAmTheEventListener2</span> <span style="color: #CC7833;">extends</span> <span style="color: #6D9CBE;">AbstractWebDriverEventListener</span>{

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateTo</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">url</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      System.out.println(<span style="color: #A5C261;">"Before Navigate To "</span>+url);
   }

   <span style="color: #6D9CBE;">@Override</span>
   <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateBack</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
      System.out.println(<span style="color: #A5C261;">"Before Navigate Back. Right now I'm at "</span>+driver.getCurrentUrl());
   }
}
</pre>
</div>
</div>
</div>
