books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** Example with Custom Listener and Registered Driver
// CustomEventListener.java
#+begin_src java
package com.packt.webdriver;

import org.openqa.selenium.support.events.AbstractWebDriverEventListener;
import org.openqa.selenium.WebDriver;

public class CustomEventListener extends AbstractWebDriverEventListener{

  @Override
  public void beforeNavigateTo(String url, WebDriver driver) {
     System.out.println("Before Navigate To "+url);

  }

  @Override
  public void beforeNavigateBack(WebDriver driver) {
     System.out.println("Before Navigate Back. Right now I'm at "+driver.getCurrentUrl());

  }

}
#+end_src
// CustomEventFiringDriver.java
#+begin_src java
package com.packt.webdriver;

import org.openqa.selenium.WebDriver;
import org.openqa.selenium.firefox.FirefoxDriver;
import org.openqa.selenium.support.events.EventFiringWebDriver;

public class CustomEventFiringDriver {
   public static void main(String... args){
      WebDriver driver = new FirefoxDriver();

      EventFiringWebDriver eventFiringDriver = new EventFiringWebDriver(driver);
      CustomEventListener eventListener = new CustomEventListener();
      eventFiringDriver.register(eventListener);

      eventFiringDriver.get("http://www.google.com");
      eventFiringDriver.get("http://www.facebook.com");
      eventFiringDriver.navigate().back();

   }
}
#+end_src
* Understanding the Page Object Pattern
