books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-12-2-3" class="outline-4">
<h4 id="sec-12-2-3">Example with Custom Listener and Registered Driver</h4>
<div class="outline-text-4" id="text-12-2-3">
<p>
// CustomEventListener.java
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.<span style="color: #6D9CBE;">webdriver</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">events</span>.<span style="color: #6D9CBE;">AbstractWebDriverEventListener</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">CustomEventListener</span> <span style="color: #CC7833;">extends</span> <span style="color: #6D9CBE;">AbstractWebDriverEventListener</span>{

  <span style="color: #6D9CBE;">@Override</span>
  <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateTo</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">url</span>, <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
     System.out.println(<span style="color: #A5C261;">"Before Navigate To "</span>+url);

  }

  <span style="color: #6D9CBE;">@Override</span>
  <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">beforeNavigateBack</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>) {
     System.out.println(<span style="color: #A5C261;">"Before Navigate Back. Right now I'm at "</span>+driver.getCurrentUrl());

  }

}
</pre>
</div>
<p>
// CustomEventFiringDriver.java
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.<span style="color: #6D9CBE;">webdriver</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">events</span>.<span style="color: #6D9CBE;">EventFiringWebDriver</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">CustomEventFiringDriver</span> {
   <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
      <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();

      <span style="color: #6D9CBE;">EventFiringWebDriver</span> <span style="color: #C8C8FF;">eventFiringDriver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">EventFiringWebDriver</span>(driver);
      <span style="color: #6D9CBE;">CustomEventListener</span> <span style="color: #C8C8FF;">eventListener</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">CustomEventListener</span>();
      eventFiringDriver.register(eventListener);

      eventFiringDriver.get(<span style="color: #A5C261;">"http://www.google.com"</span>);
      eventFiringDriver.get(<span style="color: #A5C261;">"http://www.facebook.com"</span>);
      eventFiringDriver.navigate().back();

   }
}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">Understanding the Page Object Pattern</h2>
