books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
** WordPress blog Sample Test Cases - Fine Tests that are manual to maintain.

Each of the following involves logging in to WordPress and then performing some actions.  
If an ID element on the login page changes, all three java classes would need modification.
They are excellent examples of successfully using the Selenium API in a hard to maintain fashion.

Adding a post to WordPress site http://pageobjectpattern.wordpress.com/
1) Log in to the WordPress Admin portal.
2) Go to the All Posts page.
3) Click on the Add New post button.
4) Add a new post by providing the title and description.
5) Publish the post.
   
#+begin_src java
  public class TestAddNewPost {
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      // Login to Admin portal
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin");
      WebElement email = driver.findElement(By.id("user_login"));
      WebElement pwd = driver.findElement(By.id("user_pass"));
      WebElement submit = driver.findElement(By.id("wp-submit"));
      email.sendKeys("pageobjectpattern@gmail.com");
      pwd.sendKeys("webdriver123");
      submit.click();  
      // Go to AllPosts page
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin/edit.php");
      // Add New Post
      WebElement addNewPost = driver.findElement(By.linkText("Add New"));
      addNewPost.click();
      // Add New Post's Content
      driver.switchTo().frame("content_ifr");
      WebElement postBody = driver.findElement(By.id("tinymce"));
      postBody.sendKeys("This is description");
      driver.switchTo().defaultContent();
      WebElement title = driver.findElement(By.id("title"));
      title.click();
      title.sendKeys("My First Post");
      // Publish the Post
      WebElement publish = driver.findElement(By.id("publish"));
      publish.click();
    }
  }
#+end_src

Deleting a post
1) Log in to the WordPress Admin portal.
2) Go to the All Posts page.
3) Click on the post to be deleted.
4) Delete the post.

#+begin_src java
  public class TestDeletePost {
    public static void main(String... args) {
      WebDriver driver = new FirefoxDriver();
      // Login to Admin portal
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin");
      WebElement email = driver.findElement(By.id("user_login"));
      WebElement pwd = driver.findElement(By.id("user_pass"));
      WebElement submit = driver.findElement(By.id("wp-submit"));
      email.sendKeys("pageobjectpattern@gmail.com");
      pwd.sendKeys("webdriver123");
      submit.click();      
      // Go to a All Posts page
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin/edit.php");
      // Click on the post to be deleted
      WebElement post = driver.findElement(By.linkText("My First Post"));
      post.click();
      // Delete Post
      WebElement publish = driver.findElement(By.linkText("Move to Trash"));
      publish.click();
    }
  }
#+end_src

Counting the number of posts
1) Log in to the Admin portal.
2) Go to the All Posts page.
3) Count the number of posts available.

#+begin_src java
  public class TestPostsCount {
    public static void main(String... args){
      WebDriver driver = new FirefoxDriver();
      // Login to Admin portal
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin");
      WebElement email = driver.findElement(By.id("user_login"));
      WebElement pwd = driver.findElement(By.id("user_pass"));
      WebElement submit = driver.findElement(By.id("wp-submit"));
      email.sendKeys("pageobjectpattern@gmail.com");
      pwd.sendKeys("webdriver123");
      submit.click();      
      // Count the number of posts.
      driver.get("http://pageobjectpattern.wordpress.com/wp-admin/edit.php");
      WebElement postsContainer = driver.findElement(By.id("the-list"));
      List postsList = postsContainer.findElements(By.tagName("tr"));
      System.out.println(postsList.size());
    }
  }
#+end_src
** WordPress blog using PageObject pattern
*** AdminLoginPage
#+begin_src java
  public class AdminLoginPage {
      WebDriver driver;
      WebElement email;
      WebElement password;
      WebElement submit;
      public AdminLoginPage(WebDriver driver){
          this.driver = driver;
          driver.get("http://pageobjectpattern.wordpress.com/wp-admin");
          email = driver.findElement(By.id("user_login"));
          password = driver.findElement(By.id("user_pass"));
          submit = driver.findElement(By.id("wp-submit"));
      }
      public void login(){
          email.sendKeys("pageobjectpattern@gmail.com");
          password.sendKeys("webdriver123");
          submit.click();
      }
  }
#+end_src
