books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1">WordPress blog Sample Test Cases - Fine Tests that are manual to maintain.</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Each of the following involves logging in to WordPress and then performing some actions.  
If an ID element on the login page changes, all three java classes would need modification.
They are excellent examples of successfully using the Selenium API in a hard to maintain fashion.
</p>

<p>
Adding a post to WordPress site <a href="http://pageobjectpattern.wordpress.com/">http://pageobjectpattern.wordpress.com/</a>
</p>
<ol class="org-ol">
<li>Log in to the WordPress Admin portal.
</li>
<li>Go to the All Posts page.
</li>
<li>Click on the Add New post button.
</li>
<li>Add a new post by providing the title and description.
</li>
<li>Publish the post.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestAddNewPost</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Login to Admin portal</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_login"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">pwd</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_pass"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span> = driver.findElement(By.id(<span style="color: #A5C261;">"wp-submit"</span>));
    email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
    pwd.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
    submit.click();  
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Go to AllPosts page</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Add New Post</span>
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">addNewPost</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"Add New"</span>));
    addNewPost.click();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Add New Post's Content</span>
    driver.switchTo().frame(<span style="color: #A5C261;">"content_ifr"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postBody</span> = driver.findElement(By.id(<span style="color: #A5C261;">"tinymce"</span>));
    postBody.sendKeys(<span style="color: #A5C261;">"This is description"</span>);
    driver.switchTo().defaultContent();
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">title</span> = driver.findElement(By.id(<span style="color: #A5C261;">"title"</span>));
    title.click();
    title.sendKeys(<span style="color: #A5C261;">"My First Post"</span>);
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Publish the Post</span>
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">publish</span> = driver.findElement(By.id(<span style="color: #A5C261;">"publish"</span>));
    publish.click();
  }
}
</pre>
</div>

<p>
Deleting a post
</p>
<ol class="org-ol">
<li>Log in to the WordPress Admin portal.
</li>
<li>Go to the All Posts page.
</li>
<li>Click on the post to be deleted.
</li>
<li>Delete the post.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestDeletePost</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Login to Admin portal</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_login"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">pwd</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_pass"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span> = driver.findElement(By.id(<span style="color: #A5C261;">"wp-submit"</span>));
    email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
    pwd.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
    submit.click();      
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Go to a All Posts page</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Click on the post to be deleted</span>
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">post</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"My First Post"</span>));
    post.click();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Delete Post</span>
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">publish</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"Move to Trash"</span>));
    publish.click();
  }
}
</pre>
</div>

<p>
Counting the number of posts
</p>
<ol class="org-ol">
<li>Log in to the Admin portal.
</li>
<li>Go to the All Posts page.
</li>
<li>Count the number of posts available.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestPostsCount</span> {
  <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Login to Admin portal</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_login"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">pwd</span> = driver.findElement(By.id(<span style="color: #A5C261;">"user_pass"</span>));
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span> = driver.findElement(By.id(<span style="color: #A5C261;">"wp-submit"</span>));
    email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
    pwd.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
    submit.click();      
    <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Count the number of posts.</span>
    driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postsContainer</span> = driver.findElement(By.id(<span style="color: #A5C261;">"the-list"</span>));
    <span style="color: #6D9CBE;">List</span> <span style="color: #C8C8FF;">postsList</span> = postsContainer.findElements(By.tagName(<span style="color: #A5C261;">"tr"</span>));
    System.out.println(postsList.size());
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13-2" class="outline-3">
<h3 id="sec-13-2">WordPress blog using PageObject pattern</h3>
