books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
*** TestAddNewPostUsingPageObject
#+begin_src java
  public class TestAddNewPostUsingPageObject {
     public static void main(String... args) {
         WebDriver driver = new FirefoxDriver();
         // Login to Admin portal - factored into other object only be two lines here
         AdminLoginPage admLoginPage = new AdminLoginPage(driver);
         admLoginPage.login();
         // Go to New Posts page
         driver.get("http://pageobjectpattern.wordpress.com/wp-admin/edit.php");
         WebElement addNewPost = driver.findElement(By.linkText("Add New"));
         addNewPost.click();
         // Add New Post
         driver.switchTo().frame("content_ifr");
         WebElement postBody = driver.findElement(By.id("tinymce"));
         postBody.sendKeys("This is description");
         driver.switchTo().defaultContent();
         WebElement title = driver.findElement(By.id("title"));
         title.click();
         title.sendKeys("My First Post");
         WebElement publish = driver.findElement(By.id("publish"));
         publish.click();
     }
  }
#+end_src
** Using the *@FindBy* annotation to locate elements on a page

There are two ways of using the @FindBy annotation:
    Usage 1 is shown as follows:
        @FindBy(id="user_login")
        WebElement userId;
    Usage 2 is shown as follows:
        @FindBy(how=How.ID, using="user_login")
        WebElement userId;

*** Different ways to @FindBy supported by the How enumeration
**** CLASS_NAME
**** CSS
**** ID
**** ID_OR_NAME
**** LINK_TEXT
**** NAME
**** PARTIAL_LINK_TEXT
**** TAG_NAME
**** XPATH
*** Wordpress AdminLoginPage using How and @FindBy
#+begin_src java
public class AdminLoginPage {
    WebDriver driver;

    @FindBy(how=How.ID, id="user_login")
    WebElement email;

    @FindBy(how=How.ID, id="user_pass")
    WebElement password;

    @FindBy(how=How.ID, id="wp-submit")
    WebElement submit;

    public AdminLoginPage(WebDriver driver){
        this.driver = driver;
        driver.get("http://pageobjectpattern.wordpress.com/wp-admin");
    }
    public void login(){
        email.sendKeys("pageobjectpattern@gmail.com");
        password.sendKeys("webdriver123");
        submit.click();
    }
}
#+end_src
** Using the *PageFactory* class
*** A PageFactory instantiates a Page object that uses the *@FindBy* annotations and gives it a driver
*** initElements(WebDriver driver, java.lang.Class PageObjectClass)
*** Example Use
#+begin_src java
  public class TestAddNewPostUsingPageObjects {
      public static void main(String... args){
          WebDriver driver = new FirefoxDriver();
          AdminLoginPage loginPage= PageFactory.initElements(driver, AdminLoginPage.class);
          loginPage.login();
      }
  }
#+end_src
** Good practices for using PageObjects
*** Use PageObjects within PageObjects
