books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div class="outline-text-3" id="text-13-2">
</div><div id="outline-container-sec-13-2-1" class="outline-4">
<h4 id="sec-13-2-1">AdminLoginPage</h4>
<div class="outline-text-4" id="text-13-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AdminLoginPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span>;
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">password</span>;
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span>;
    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AdminLoginPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
        email = driver.findElement(By.id(<span style="color: #A5C261;">"user_login"</span>));
        password = driver.findElement(By.id(<span style="color: #A5C261;">"user_pass"</span>));
        submit = driver.findElement(By.id(<span style="color: #A5C261;">"wp-submit"</span>));
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">login</span>(){
        email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
        password.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
        submit.click();
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13-2-2" class="outline-4">
<h4 id="sec-13-2-2">TestAddNewPostUsingPageObject</h4>
<div class="outline-text-4" id="text-13-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestAddNewPostUsingPageObject</span> {
   <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>) {
       <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
       <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Login to Admin portal - factored into other object only be two lines here</span>
       <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">admLoginPage</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">AdminLoginPage</span>(driver);
       admLoginPage.login();
       <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Go to New Posts page</span>
       driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
       <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">addNewPost</span> = driver.findElement(By.linkText(<span style="color: #A5C261;">"Add New"</span>));
       addNewPost.click();
       <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Add New Post</span>
       driver.switchTo().frame(<span style="color: #A5C261;">"content_ifr"</span>);
       <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postBody</span> = driver.findElement(By.id(<span style="color: #A5C261;">"tinymce"</span>));
       postBody.sendKeys(<span style="color: #A5C261;">"This is description"</span>);
       driver.switchTo().defaultContent();
       <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">title</span> = driver.findElement(By.id(<span style="color: #A5C261;">"title"</span>));
       title.click();
       title.sendKeys(<span style="color: #A5C261;">"My First Post"</span>);
       <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">publish</span> = driver.findElement(By.id(<span style="color: #A5C261;">"publish"</span>));
       publish.click();
   }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13-3" class="outline-3">
<h3 id="sec-13-3">Using the <b>@FindBy</b> annotation to locate elements on a page</h3>
<div class="outline-text-3" id="text-13-3">
<p>
There are two ways of using the @FindBy annotation:
    Usage 1 is shown as follows:
        @FindBy(id="user_login")
        WebElement userId;
    Usage 2 is shown as follows:
        @FindBy(how=How.ID, using="user_login")
        WebElement userId;
</p>
</div>

<div id="outline-container-sec-13-3-1" class="outline-4">
<h4 id="sec-13-3-1">Different ways to @FindBy supported by the How enumeration</h4>
<div class="outline-text-4" id="text-13-3-1">
</div><ul class="org-ul"><li><a id="sec-13-3-1-1" name="sec-13-3-1-1"></a>CLASS_NAME<br  /></li>
<li><a id="sec-13-3-1-2" name="sec-13-3-1-2"></a>CSS<br  /></li>
<li><a id="sec-13-3-1-3" name="sec-13-3-1-3"></a>ID<br  /></li>
<li><a id="sec-13-3-1-4" name="sec-13-3-1-4"></a>ID_OR_NAME<br  /></li>
<li><a id="sec-13-3-1-5" name="sec-13-3-1-5"></a>LINK_TEXT<br  /></li>
<li><a id="sec-13-3-1-6" name="sec-13-3-1-6"></a>NAME<br  /></li>
<li><a id="sec-13-3-1-7" name="sec-13-3-1-7"></a>PARTIAL_LINK_TEXT<br  /></li>
<li><a id="sec-13-3-1-8" name="sec-13-3-1-8"></a>TAG_NAME<br  /></li>
<li><a id="sec-13-3-1-9" name="sec-13-3-1-9"></a>XPATH<br  /></li></ul>
</div>
<div id="outline-container-sec-13-3-2" class="outline-4">
<h4 id="sec-13-3-2">Wordpress AdminLoginPage using How and @FindBy</h4>
<div class="outline-text-4" id="text-13-3-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AdminLoginPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, id=<span style="color: #A5C261;">"user_login"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, id=<span style="color: #A5C261;">"user_pass"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">password</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, id=<span style="color: #A5C261;">"wp-submit"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AdminLoginPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">login</span>(){
        email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
        password.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
        submit.click();
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13-4" class="outline-3">
<h3 id="sec-13-4">Using the <b>PageFactory</b> class</h3>
<div class="outline-text-3" id="text-13-4">
</div><div id="outline-container-sec-13-4-1" class="outline-4">
<h4 id="sec-13-4-1">A PageFactory instantiates a Page object that uses the <b>@FindBy</b> annotations and gives it a driver</h4>
</div>
<div id="outline-container-sec-13-4-2" class="outline-4">
<h4 id="sec-13-4-2">initElements(WebDriver driver, java.lang.Class PageObjectClass)</h4>
</div>
<div id="outline-container-sec-13-4-3" class="outline-4">
<h4 id="sec-13-4-3">Example Use</h4>
<div class="outline-text-4" id="text-13-4-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestAddNewPostUsingPageObjects</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
        <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">loginPage</span>= PageFactory.initElements(driver, AdminLoginPage.<span style="color: #CC7833;">class</span>);
        loginPage.login();
    }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13-5" class="outline-3">
<h3 id="sec-13-5">Good practices for using PageObjects</h3>
<div class="outline-text-3" id="text-13-5">
</div><div id="outline-container-sec-13-5-1" class="outline-4">
<h4 id="sec-13-5-1">Use PageObjects within PageObjects</h4>
