books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
**** Example *AllPostsPage*
#+begin_src java
  public class AllPostsPage {
      WebDriver driver;
      @FindBy(how=How.ID, using="the-list")
      WebElement postsContainer;
      @FindBy(how=How.ID, using="post-search-input")
      WebElement searchPosts;
      @FindBy(how=How.ID, using="cat")
      WebElement viewByCategories;
      public AllPostsPage(WebDriver driver){
          this.driver = driver;
              driver.get("http://pageobjectpattern.wordpress.com/wp-admin/edit.php");
      }
      public void createANewPost(String title, String description) {
          addNewPost.click();
          // use an AddNewPost object here
          AddNewPost newPost = PageFactory.initElements(driver, AddNewPost.class);
          newPost.addNewPost(title, description);
      }
      public void editAPost(String title){
      }
      public void deleteAPost(String postTitle) {
      }
      public void filterPostsByCategory(String category){
      }
      public void searchInPosts(String searchText){
      }
      public int getAllPostsCount(){
      }
    }
  /* In AddNewPost.java */
  public class AddNewPost {
      WebDriver driver;
      @FindBy(how=How.ID, using="content_ifr")
      WebElement newPostContentFrame;
      @FindBy(how=How.ID, using="tinymce")
      WebElement newPostContentBody;
      @FindBy(how=How.ID, using="title")
      WebElement newPostTitle;
      @FindBy(how=How.ID, using="publish")
      WebElement newPostPublish;
      public AddNewPost(WebDriver driver){
          this.driver = driver;
          System.out.println(driver.getCurrentUrl());
      }
      public void addNewPost(String title, String descContent){
           driver.switchTo().frame(newPostContentFrame);
           newPostContentBody.sendKeys(descContent);
           driver.switchTo().defaultContent();
           newPostTitle.click();
           newPostTitle.sendKeys(title);
           newPostPublish.click();
      }
  }
#+end_src
*** Consider methods in PageObjects as services and not as User Actions
At a high level, a webpage is a collection of services (such as 'add a post', 'edit a post', etc).  
So a PageObject should provide these services to a test case.  Be sure to include "implied services"
that are provided simply by reading the page (like "count posts" if there is a post listing).

Using a service can (and often will) involve multiple user actions.  You should abstract this layer.
Example: Adding a post requires "type text in title", "type text in content", and "click publish" actions.
*** Initialize some elements as required; especially lists (source example)
#+begin_src java
public class AllPostsPage {
    WebDriver driver;
    @FindBy(how=How.ID, using="the-list")
    WebElement postsContainer;
    public void editAPost(String presentTitle,String newTitle, String description){
        List<WebElement> allPosts= postsContainer.findElements(By.className("row-title"));
        for(WebElement ele : allPosts){
        if(ele.getText().equals(presentTitle)){
                Actions builder = new Actions(driver);
                builder.moveToElement(ele);
                builder.click(driver.findElement(By.cssSelector(".edit>a")));
                // Generate the composite action.
                Action compositeAction = builder.build();
                // Perform the composite action.
                compositeAction.perform();
                break;
            }
        }
        EditPost editPost= PageFactory.initElements(driver, EditPost.class);
        editPost.editPost(newTitle, description);
    }
}
#+end_src
*** Keep page specific details of the test script (main goal!)
** Checking load()/isLoad() with *LoadableComponent* class
*** load specifies a url that should be loaded
*** isLoaded checks that the page specified in load() came up
*** the get method attempts the load() and does the isLoaded() check
