books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div class="outline-text-4" id="text-13-5-1">
</div><ul class="org-ul"><li><a id="sec-13-5-1-1" name="sec-13-5-1-1"></a>Example <b>AllPostsPage</b><br  /><div class="outline-text-5" id="text-13-5-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AllPostsPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"the-list"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postsContainer</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"post-search-input"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchPosts</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"cat"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">viewByCategories</span>;
    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AllPostsPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
            driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">createANewPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">description</span>) {
        addNewPost.click();
        <span style="color: #BC9458;">// </span><span style="color: #BC9458;">use an AddNewPost object here</span>
        <span style="color: #6D9CBE;">AddNewPost</span> <span style="color: #C8C8FF;">newPost</span> = PageFactory.initElements(driver, AddNewPost.<span style="color: #CC7833;">class</span>);
        newPost.addNewPost(title, description);
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">editAPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>){
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">deleteAPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">postTitle</span>) {
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">filterPostsByCategory</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">category</span>){
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">searchInPosts</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">searchText</span>){
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">int</span> <span style="color: #FFC66D;">getAllPostsCount</span>(){
    }
  }
<span style="color: #BC9458;">/* </span><span style="color: #BC9458;">In AddNewPost.java */</span>
<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AddNewPost</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"content_ifr"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentFrame</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"tinymce"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentBody</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"title"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostTitle</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"publish"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostPublish</span>;
    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AddNewPost</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">addNewPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">descContent</span>){
         driver.switchTo().frame(newPostContentFrame);
         newPostContentBody.sendKeys(descContent);
         driver.switchTo().defaultContent();
         newPostTitle.click();
         newPostTitle.sendKeys(title);
         newPostPublish.click();
    }
}
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-13-5-2" class="outline-4">
<h4 id="sec-13-5-2">Consider methods in PageObjects as services and not as User Actions</h4>
<div class="outline-text-4" id="text-13-5-2">
<p>
At a high level, a webpage is a collection of services (such as 'add a post', 'edit a post', etc).  
So a PageObject should provide these services to a test case.  Be sure to include "implied services"
that are provided simply by reading the page (like "count posts" if there is a post listing).
</p>

<p>
Using a service can (and often will) involve multiple user actions.  You should abstract this layer.
Example: Adding a post requires "type text in title", "type text in content", and "click publish" actions.
</p>
</div>
</div>
<div id="outline-container-sec-13-5-3" class="outline-4">
<h4 id="sec-13-5-3">Initialize some elements as required; especially lists (source example)</h4>
<div class="outline-text-4" id="text-13-5-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AllPostsPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"the-list"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postsContainer</span>;
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">editAPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">presentTitle</span>,<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">newTitle</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">description</span>){
        <span style="color: #6D9CBE;">List</span>&lt;<span style="color: #6D9CBE;">WebElement</span>&gt; <span style="color: #C8C8FF;">allPosts</span>= postsContainer.findElements(By.className(<span style="color: #A5C261;">"row-title"</span>));
        <span style="color: #CC7833;">for</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">ele</span> : allPosts){
        <span style="color: #CC7833;">if</span>(ele.getText().equals(presentTitle)){
                <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
                builder.moveToElement(ele);
                builder.click(driver.findElement(By.cssSelector(<span style="color: #A5C261;">".edit&gt;a"</span>)));
                <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Generate the composite action.</span>
                <span style="color: #6D9CBE;">Action</span> <span style="color: #C8C8FF;">compositeAction</span> = builder.build();
                <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Perform the composite action.</span>
                compositeAction.perform();
                <span style="color: #CC7833;">break</span>;
            }
        }
        <span style="color: #6D9CBE;">EditPost</span> <span style="color: #C8C8FF;">editPost</span>= PageFactory.initElements(driver, EditPost.<span style="color: #CC7833;">class</span>);
        editPost.editPost(newTitle, description);
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-13-5-4" class="outline-4">
<h4 id="sec-13-5-4">Keep page specific details of the test script (main goal!)</h4>
</div>
</div>
<div id="outline-container-sec-13-6" class="outline-3">
<h3 id="sec-13-6">Checking load()/isLoad() with <b>LoadableComponent</b> class</h3>
<div class="outline-text-3" id="text-13-6">
</div><div id="outline-container-sec-13-6-1" class="outline-4">
<h4 id="sec-13-6-1">load specifies a url that should be loaded</h4>
</div>
<div id="outline-container-sec-13-6-2" class="outline-4">
<h4 id="sec-13-6-2">isLoaded checks that the page specified in load() came up</h4>
</div>
<div id="outline-container-sec-13-6-3" class="outline-4">
<h4 id="sec-13-6-3">the get method attempts the load() and does the isLoaded() check</h4>
</div>
