books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<div id="outline-container-sec-13-6-4" class="outline-4">
<h4 id="sec-13-6-4">Full example of use</h4>
<div class="outline-text-4" id="text-13-6-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">package</span> com.packt.webdriver.chapter9.<span style="color: #6D9CBE;">pageObjects</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">junit</span>.<span style="color: #6D9CBE;">Assert</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">CacheLookup</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">ui</span>.<span style="color: #6D9CBE;">LoadableComponent</span>;
<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AdminLoginPageUsingLoadableComponent</span> <span style="color: #CC7833;">extends</span> <span style="color: #6D9CBE;">LoadableComponent</span>&lt;<span style="color: #6D9CBE;">AdminLoginPageUsingLoadableComponent</span>&gt;{
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"user_login"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"user_pass"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">password</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"wp-submit"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span>;
    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AdminLoginPageUsingLoadableComponent</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        PageFactory.initElements(driver, <span style="color: #CC7833;">this</span>);
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #FFC66D;">login</span>(){
        email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
        password.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
        submit.click();
        <span style="color: #CC7833;">return</span> PageFactory.initElements(driver,
                AllPostsPage.<span style="color: #CC7833;">class</span>);
    }
    <span style="color: #6D9CBE;">@Override</span>
    <span style="color: #CC7833;">protected</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">load</span>() {
        driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    }
    <span style="color: #6D9CBE;">@Override</span>
    <span style="color: #CC7833;">protected</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">isLoaded</span>() <span style="color: #CC7833;">throws</span> <span style="color: #6D9CBE;">Error</span> {
        Assert.assertTrue(driver.getCurrentUrl().contains(<span style="color: #A5C261;">"wp-admin"</span>));
    }
}
<span style="color: #BC9458;">// </span><span style="color: #BC9458;">using it in a test</span>
<span style="color: #6D9CBE;">AdminLoginPageUsingLoadableComponent</span> <span style="color: #C8C8FF;">loginPage</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">AdminLoginPageUsingLoadableComponent</span>(driver).get();
<span style="color: #BC9458;">// </span><span style="color: #BC9458;">it will throw the exception if load doesn't work</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-13-7" class="outline-3">
<h3 id="sec-13-7">Full Wordpress PageObject example with TestCases</h3>
<div class="outline-text-3" id="text-13-7">
</div><div id="outline-container-sec-13-7-1" class="outline-4">
<h4 id="sec-13-7-1">PageObject's</h4>
<div class="outline-text-4" id="text-13-7-1">
</div><ul class="org-ul"><li><a id="sec-13-7-1-1" name="sec-13-7-1-1"></a>AdminLoginPage.java<br  /><div class="outline-text-5" id="text-13-7-1-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">CacheLookup</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AdminLoginPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"user_login"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">email</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"user_pass"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">password</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"wp-submit"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">submit</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AdminLoginPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin"</span>);
    }

    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #FFC66D;">login</span>(){
        email.sendKeys(<span style="color: #A5C261;">"pageobjectpattern@gmail.com"</span>);
        password.sendKeys(<span style="color: #A5C261;">"webdriver123"</span>);
        submit.click();
        <span style="color: #CC7833;">return</span> PageFactory.initElements(driver, AllPostsPage.<span style="color: #CC7833;">class</span>);
    }
}
</pre>
</div>
</div>
</li>
