books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<li><a id="sec-13-7-1-2" name="sec-13-7-1-2"></a>AllPostsPage.java<br  /><div class="outline-text-5" id="text-13-7-1-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">java</span>.<span style="color: #6D9CBE;">util</span>.<span style="color: #6D9CBE;">List</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">By</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">interactions</span>.<span style="color: #6D9CBE;">Action</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">interactions</span>.<span style="color: #6D9CBE;">Actions</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AllPostsPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"the-list"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">postsContainer</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"post-search-input"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">searchPosts</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"cat"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">viewByCategories</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.LINK_TEXT, using=<span style="color: #A5C261;">"Add New"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">addNewPost</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AllPostsPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        driver.get(<span style="color: #A5C261;">"http://pageobjectpattern.wordpress.com/wp-admin/edit.php"</span>);
    }

    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">createANewPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">description</span>){
        addNewPost.click();
        <span style="color: #6D9CBE;">AddNewPostPage</span> <span style="color: #C8C8FF;">newPost</span> = PageFactory.initElements(driver, AddNewPostPage.<span style="color: #CC7833;">class</span>);
        newPost.addNewPost(title, description);
    }  
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">editAPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">presentTitle</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">newTitle</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">description</span>){
        goToParticularPostPage(presentTitle);
        <span style="color: #6D9CBE;">EditPostPage</span> <span style="color: #C8C8FF;">editPost</span> = PageFactory.initElements(driver, EditPostPage.<span style="color: #CC7833;">class</span>);
        editPost.editPost(newTitle, description);
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">deleteAPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>) {
        goToParticularPostPage(title);
        <span style="color: #6D9CBE;">DeletePostPage</span> <span style="color: #C8C8FF;">deletePost</span> = PageFactory.initElements(driver, DeletePostPage.<span style="color: #CC7833;">class</span>);
        deletePost.delete();
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">filterPostsByCategory</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">category</span>){
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">searchInPosts</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">searchText</span>){
    }
    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">int</span> <span style="color: #FFC66D;">getAllPostsCount</span>(){
      <span style="color: #6D9CBE;">List</span>&lt;<span style="color: #6D9CBE;">WebElement</span>&gt; <span style="color: #C8C8FF;">postsList</span> = postsContainer.findElements(By.tagName(<span style="color: #A5C261;">"tr"</span>));
      <span style="color: #CC7833;">return</span> postsList.size();
    }
    <span style="color: #CC7833;">private</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">goToParticularPostPage</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>){<span style="color: #6D9CBE;">List</span>&lt;<span style="color: #6D9CBE;">WebElement</span>&gt; <span style="color: #C8C8FF;">allPosts</span>= postsContainer.findElements(By.className(<span style="color: #A5C261;">"row-title"</span>));
        <span style="color: #CC7833;">for</span>(<span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">ele</span> : allPosts){
            <span style="color: #CC7833;">if</span>(ele.getText().equals(title)){
                <span style="color: #6D9CBE;">Actions</span> <span style="color: #C8C8FF;">builder</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">Actions</span>(driver);
                builder.moveToElement(ele);
                builder.click(driver.findElement(
                        By.cssSelector(<span style="color: #A5C261;">".edit&gt;a"</span>)));
                <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Generate the composite action.</span>
                <span style="color: #6D9CBE;">Action</span> <span style="color: #C8C8FF;">compositeAction</span> = builder.build();
                <span style="color: #BC9458;">// </span><span style="color: #BC9458;">Perform the composite action.</span>
                compositeAction.perform();
                <span style="color: #CC7833;">break</span>;
            }
        }
    }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-13-7-1-3" name="sec-13-7-1-3"></a>AddNewPostPage.java<br  /><div class="outline-text-5" id="text-13-7-1-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">AddNewPostPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"content_ifr"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentFrame</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"tinymce"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentBody</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"title"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostTitle</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"publish"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostPublish</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">AddNewPostPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }

    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">addNewPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">descContent</span>){
         driver.switchTo().frame(newPostContentFrame);
         newPostContentBody.sendKeys(descContent);
         driver.switchTo().defaultContent();
         newPostTitle.click();
         newPostTitle.sendKeys(title);
         newPostPublish.click();
    }
}
</pre>
</div>
</div>
</li>
