books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
**** EditPostPage.java
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.WebElement;
import org.openqa.selenium.support.FindBy;
import org.openqa.selenium.support.How;

public class EditPostPage {
    WebDriver driver;

    @FindBy(how=How.ID, using="content_ifr")
    WebElement newPostContentFrame;
    @FindBy(how=How.ID, using="tinymce")
    WebElement newPostContentBody;
    @FindBy(how=How.ID, using="title")
    WebElement newPostTitle;
    @FindBy(how=How.ID, using="publish")
    WebElement newPostPublish;

    public EditPostPage(WebDriver driver){
        this.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }

    public void editPost(String title, String descContent){
         driver.switchTo().frame(newPostContentFrame);
         newPostContentBody.clear();
         newPostContentBody.sendKeys(descContent);
         driver.switchTo().defaultContent();
         newPostTitle.click();
         newPostTitle.clear();
         newPostTitle.sendKeys(title);
         newPostPublish.click();
    }
}
#+end_src
**** DeletePostPage.java
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.WebElement;
import org.openqa.selenium.support.FindBy;
import org.openqa.selenium.support.How;

public class DeletePostPage {
    WebDriver driver;

    @FindBy(how=How.LINK_TEXT, using="Move to Trash")
    WebElement moveToTrash;

    public DeletePostPage(WebDriver driver){
        this.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }

    public void delete(){
        moveToTrash.click();
    }
}
#+end_src
*** Tests
**** Adding a new post
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.firefox.FirefoxDriver;
import org.openqa.selenium.support.PageFactory;

import com.packt.webdriver.wordpress.pageObjects.AdminLoginPage;
import com.packt.webdriver.wordpress.pageObjects.AllPostsPage;

public class TestAddNewPostUsingPageObjects {
    public static void main(String... args){
        WebDriver driver = new FirefoxDriver();
        AdminLoginPage loginPage = PageFactory.initElements(driver, AdminLoginPage.class);
        AllPostsPage allPostsPage = loginPage.login();
        allPostsPage.createANewPost("Creating New Post using PageObjects",
                "Its good to use PageObjects");
    }
}
#+end_src
**** Editing a post
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.chrome.ChromeDriver;
import org.openqa.selenium.support.PageFactory;

import com.packt.webdriver.wordpress.pageObjects.AdminLoginPage;
import com.packt.webdriver.wordpress.pageObjects.AllPostsPage;

public class TestEditPostUsingPageObjects {
    public static void main(String... args){
        System.setProperty("webdriver.chrome.driver", "C:\\chromedriver_win32_2.2\\chromedriver.exe");
        WebDriver driver = new ChromeDriver();
        AdminLoginPage loginPage = PageFactory.initElements(driver,AdminLoginPage.class);
        AllPostsPage allPostsPage = loginPage.login();
        allPostsPage.editAPost("Creating New Post using PageObjects",
                "Editing Post using PageObjects","Test framework low maintenance");
    }
}
#+end_src
