books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<li><a id="sec-13-7-1-4" name="sec-13-7-1-4"></a>EditPostPage.java<br  /><div class="outline-text-5" id="text-13-7-1-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">EditPostPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"content_ifr"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentFrame</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"tinymce"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostContentBody</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"title"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostTitle</span>;
    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.ID, using=<span style="color: #A5C261;">"publish"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">newPostPublish</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">EditPostPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }

    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">editPost</span>(<span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">title</span>, <span style="color: #6D9CBE;">String</span> <span style="color: #C8C8FF;">descContent</span>){
         driver.switchTo().frame(newPostContentFrame);
         newPostContentBody.clear();
         newPostContentBody.sendKeys(descContent);
         driver.switchTo().defaultContent();
         newPostTitle.click();
         newPostTitle.clear();
         newPostTitle.sendKeys(title);
         newPostPublish.click();
    }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-13-7-1-5" name="sec-13-7-1-5"></a>DeletePostPage.java<br  /><div class="outline-text-5" id="text-13-7-1-5">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebElement</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">FindBy</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">How</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">DeletePostPage</span> {
    <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>;

    <span style="color: #6D9CBE;">@FindBy</span>(how=<span style="color: #6D9CBE;">How</span>.LINK_TEXT, using=<span style="color: #A5C261;">"Move to Trash"</span>)
    <span style="color: #6D9CBE;">WebElement</span> <span style="color: #C8C8FF;">moveToTrash</span>;

    <span style="color: #CC7833;">public</span> <span style="color: #FFC66D;">DeletePostPage</span>(<span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span>){
        <span style="color: #CC7833;">this</span>.driver = driver;
        System.out.println(driver.getCurrentUrl());
    }

    <span style="color: #CC7833;">public</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">delete</span>(){
        moveToTrash.click();
    }
}
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-13-7-2" class="outline-4">
<h4 id="sec-13-7-2">Tests</h4>
<div class="outline-text-4" id="text-13-7-2">
</div><ul class="org-ul"><li><a id="sec-13-7-2-1" name="sec-13-7-2-1"></a>Adding a new post<br  /><div class="outline-text-5" id="text-13-7-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">firefox</span>.<span style="color: #6D9CBE;">FirefoxDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AdminLoginPage</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AllPostsPage</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestAddNewPostUsingPageObjects</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">FirefoxDriver</span>();
        <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">loginPage</span> = PageFactory.initElements(driver, AdminLoginPage.<span style="color: #CC7833;">class</span>);
        <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #C8C8FF;">allPostsPage</span> = loginPage.login();
        allPostsPage.createANewPost(<span style="color: #A5C261;">"Creating New Post using PageObjects"</span>,
                <span style="color: #A5C261;">"Its good to use PageObjects"</span>);
    }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-13-7-2-2" name="sec-13-7-2-2"></a>Editing a post<br  /><div class="outline-text-5" id="text-13-7-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">chrome</span>.<span style="color: #6D9CBE;">ChromeDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AdminLoginPage</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AllPostsPage</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestEditPostUsingPageObjects</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
        System.setProperty(<span style="color: #A5C261;">"webdriver.chrome.driver"</span>, <span style="color: #A5C261;">"C:\\chromedriver_win32_2.2\\chromedriver.exe"</span>);
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">ChromeDriver</span>();
        <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">loginPage</span> = PageFactory.initElements(driver,AdminLoginPage.<span style="color: #CC7833;">class</span>);
        <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #C8C8FF;">allPostsPage</span> = loginPage.login();
        allPostsPage.editAPost(<span style="color: #A5C261;">"Creating New Post using PageObjects"</span>,
                <span style="color: #A5C261;">"Editing Post using PageObjects"</span>,<span style="color: #A5C261;">"Test framework low maintenance"</span>);
    }
}
</pre>
</div>
</div>
</li>
