books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.org
**** Deleting a post
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.chrome.ChromeDriver;
import org.openqa.selenium.support.PageFactory;

import com.packt.webdriver.wordpress.pageObjects.AdminLoginPage;
import com.packt.webdriver.wordpress.pageObjects.AllPostsPage;

public class TestDeleteAPostUsingPageObjects {
    public static void main(String... args){
        System.setProperty("webdriver.chrome.driver", "C:\\chromedriver_win32_2.2\\chromedriver.exe");
        WebDriver driver = new ChromeDriver();
        AdminLoginPage loginPage = PageFactory.initElements(driver,AdminLoginPage.class);
        AllPostsPage allPostsPage = loginPage.login();
        allPostsPage.deleteAPost("Creating New Post using PageObjects");
    }
}
#+end_src
**** Counting posts
#+begin_src java
import org.openqa.selenium.WebDriver;
import org.openqa.selenium.chrome.ChromeDriver;
import org.openqa.selenium.support.PageFactory;

import com.packt.webdriver.wordpress.pageObjects.AdminLoginPage;
import com.packt.webdriver.wordpress.pageObjects.AllPostsPage;

public class TestPostsCountUsingPageObjects {
    public static void main(String... args){
        System.setProperty("webdriver.chrome.driver", "C:\\chromedriver_win32_2.2\\chromedriver.exe");
        WebDriver driver = new ChromeDriver();
        AdminLoginPage loginPage = PageFactory.initElements(driver,AdminLoginPage.class);
        AllPostsPage allPostsPage = loginPage.login();
        System.out.println(allPostsPage.getAllPostsCount());
    }
}
#+end_src
* Skipped Chapters: Dealing with I/O (FileHandler, isZipped, etc), RemoteWebDriver, Selenium Grid, iOS/Android
