books/programming/java/Selenium-WebDriver-Practical-Guide_Packt_2014.html
<li><a id="sec-13-7-2-3" name="sec-13-7-2-3"></a>Deleting a post<br  /><div class="outline-text-5" id="text-13-7-2-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">chrome</span>.<span style="color: #6D9CBE;">ChromeDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AdminLoginPage</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AllPostsPage</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestDeleteAPostUsingPageObjects</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
        System.setProperty(<span style="color: #A5C261;">"webdriver.chrome.driver"</span>, <span style="color: #A5C261;">"C:\\chromedriver_win32_2.2\\chromedriver.exe"</span>);
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">ChromeDriver</span>();
        <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">loginPage</span> = PageFactory.initElements(driver,AdminLoginPage.<span style="color: #CC7833;">class</span>);
        <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #C8C8FF;">allPostsPage</span> = loginPage.login();
        allPostsPage.deleteAPost(<span style="color: #A5C261;">"Creating New Post using PageObjects"</span>);
    }
}
</pre>
</div>
</div>
</li>
<li><a id="sec-13-7-2-4" name="sec-13-7-2-4"></a>Counting posts<br  /><div class="outline-text-5" id="text-13-7-2-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">WebDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">chrome</span>.<span style="color: #6D9CBE;">ChromeDriver</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">org</span>.<span style="color: #6D9CBE;">openqa</span>.<span style="color: #6D9CBE;">selenium</span>.<span style="color: #6D9CBE;">support</span>.<span style="color: #6D9CBE;">PageFactory</span>;

<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AdminLoginPage</span>;
<span style="color: #CC7833;">import</span> <span style="color: #6D9CBE;">com</span>.<span style="color: #6D9CBE;">packt</span>.<span style="color: #6D9CBE;">webdriver</span>.<span style="color: #6D9CBE;">wordpress</span>.<span style="color: #6D9CBE;">pageObjects</span>.<span style="color: #6D9CBE;">AllPostsPage</span>;

<span style="color: #CC7833;">public</span> <span style="color: #CC7833;">class</span> <span style="color: #6D9CBE;">TestPostsCountUsingPageObjects</span> {
    <span style="color: #CC7833;">public</span> <span style="color: #CC7833;">static</span> <span style="color: #6D9CBE;">void</span> <span style="color: #FFC66D;">main</span>(<span style="color: #6D9CBE;">String</span>... <span style="color: #C8C8FF;">args</span>){
        System.setProperty(<span style="color: #A5C261;">"webdriver.chrome.driver"</span>, <span style="color: #A5C261;">"C:\\chromedriver_win32_2.2\\chromedriver.exe"</span>);
        <span style="color: #6D9CBE;">WebDriver</span> <span style="color: #C8C8FF;">driver</span> = <span style="color: #CC7833;">new</span> <span style="color: #6D9CBE;">ChromeDriver</span>();
        <span style="color: #6D9CBE;">AdminLoginPage</span> <span style="color: #C8C8FF;">loginPage</span> = PageFactory.initElements(driver,AdminLoginPage.<span style="color: #CC7833;">class</span>);
        <span style="color: #6D9CBE;">AllPostsPage</span> <span style="color: #C8C8FF;">allPostsPage</span> = loginPage.login();
        System.out.println(allPostsPage.getAllPostsCount());
    }
}
</pre>
</div>
</div>
</li></ul>
</div>
</div>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">Skipped Chapters: Dealing with I/O (FileHandler, isZipped, etc), RemoteWebDriver, Selenium Grid, iOS/Android</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lewis Cawthorne</p>
<p class="date">Created: 2015-05-19 Tue 15:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
